[
    {
        "id": "O&M_Blower_pg2_chunk1",
        "text_to_embed": "Before operating your Beta rotary twin lobe blower, it is essential to be familier with the equipment and its associated system for best possible performance of operation & periodic maintenance. Our blowers are designed, manufactured and serviced using meticulous quality checks to achieve excellence of the product performance. Present scenario of competitive world has reached to a stage where quality is to be recognized as an indispensable necessity in any industry, more so in engineering industry. Our incessant efforts to maintain the highest quality standard, putting each & every component of the blower to high quality checks to suit the specific requirements ensures trouble free operation of the blower. All  eta blowers are tested as per British Standard 1571(part-II) and closest to actual service conditions of the equipment.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 2,
            "heading": "Introduction",
            "timestamp": "2025-05-06T11:48:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg4_chunk1",
        "text_to_embed": "Beta twin lobe rotary blower is a positive displacement type unit and its pumping capacity is determined by size, operating speed and pressure condition. The equipment consists of two 8 shaped rotor mounted on parallel shafts which rotate in opposite direction within a casing. As the rotor rotates, air is drawn inside the casing and forced out through the opposite opening (discharge post) against the existing pressur of the receiver system. The differential pressure developed totally depends on the resistance of the receiver system. The blower does not develop any pressure within the casing but it works against the back pressure i.e. against resistance of the connected system. Properly designed piping with long radius bends and tangentially connected 'T' points ensure minimum pressure drop across pipe line resulting in energy saving. The shape of the Rotor is such that a small accurate clearance is maintained throughout between the rotors, rotor and casing, which also gives an effective sealing from inlet port to the outlet port. A pair of accurately machined alloy steel. hardened and ground timing gears maintain clearance between the rotors during rotation. A small clearance is maintained with the rotating part and stationary part inside the blower chamber and hence no lubrication is used inside. Thus it is ensured that the air delivered by twin lobe rotary piston blower is 100% oil free.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 4,
            "heading": "Working Principle",
            "timestamp": "2025-05-06T11:53:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg6_chunk1",
        "text_to_embed": "1. Suction filter: - The filter protects the blower against dust, dirt and any foreign material. The dust is entered inside the blower chamber, will get deposited on casing inner wall and on the rotor. This will reduce clearance and may result in machine seizure. Any foreign object sucked inside, will damage the machine. So the suction filter is necessary for the safe and smooth working of machine. The filter element must be kept clean otherwise blower can be damaged as a result of overheating. 2. Silencers: - Silencer is basically used to reduce the sound level. The sound produced by machine is air-born sound only, since none of the parts are touching each other. Silencers are used at both suction and discharge terminals for medium and high capacity blower and only at suction for the low capacity blower as a standard. 3. Discharge silencer can be provided for low capacity blower, if asked for. Pressure gauge: - It is an instrument to measure pressure across the connected system at the discharge end of blower, (optional). 4. Safety Valve (safety device): - The safety valve is provided on the delivery side of the blower. It protects the machine against any abnormal rise in the pressure. This may happen due to blockage in delivery line. If there is any blockage in delivery line, the pressure will rise and may lead to blower / pipeline failure. Therefore the safety valve is a must for safe working of blower. The valve is adjusted to be operated when pressure rises beyond the safe limit. 5. Non Return Valve (NRV): - It may be fitted to the discharge port (after the silencer is connected) to prevent the blower from running in opposite direction when switched off under load condition. When blower used in parallel having air discharge into common header, NRV must be used to avoid the leakage air from one blower to another.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 6,
            "heading": "BLOWER ACCESSORIES",
            "timestamp": "2025-05-06T11:57:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg8_chunk1",
        "text_to_embed": "GENERAL INSTRUCTION: Every aspect should be given due attention for proper installation of the machine. The foundation arrangement of accessories, pipe work and any noise dampening measure  (silencer), also has to be considered. The installation should be carried out exactly as per general arrangement drawing provided by the manufacturer. Install the blower in a well set up, clean dry place with space for inspection and maintenance. This blower is suitable for both indoor and outdoor location. Necessary precautions must be taken while installing outside.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 8,
            "heading": "GENERAL INSTRUCTION",
            "timestamp": "2025-05-06T12:00:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg8_chunk2",
        "text_to_embed": "Foundation: Place the base frame with / without blower on a concrete or equally leveled foundation. Put the foundation bolt in the grouting pocket and holes provided in the base frame. Check the rough leveling of the base frame and fill the grouting pockets and allow it to set. After setting, place the anti vibration mounting between the base frame and concrete as shown in fig. 4, tighten the foundation bolts and check the level of base frame. Put packings, if required. Now check the leveling of blower, add shims, is required between the base frame and the blower leg, then fasten the bolts. Ensure that the blower casing is not distorted when the foundation bolts are tightened.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 8,
            "heading": "Foundation",
            "timestamp": "2025-05-06T12:04:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg9_chunk1",
        "text_to_embed": "DRIVE INSTRUCTION: If the blower is directly coupled, alignment is a very important factor and it must be taken care of very accurately. The recommended gap should be maintained within the coupling and the alignment in both horizontal and vertical direction should be ensured. A flexible type coupling should be used to connect the driver and the blower shaft. Caution: Non-alignment coupling halves will lead to premature bearing failure and shaft breakage. Belt Drive: Align the pulleys very carefully because non-alignment may lead to premature failure of the belt or bearing. V-belts are tightened in such a way that v-belts are able to be pressed by approx. 10mm, when pressed with thumb in the middle of span. Excessive Tension must be avoided. Caution : Over tightened belts lead to heavy bearing load and shaft deflections and may result in premature failure of bearing / shaft. Attention : The belt pulleys are always supposed to be on the shaft in such a way that the belt pully is close to the machine. Piping : It is essential that pipe connection should match up to the compressor flanges without strain and that the pipe work is adequately supported. Caution : Precaution must be taken that, in any case, load due to pipe work should not be created on the machine.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 9,
            "heading": "DRIVE INSTRUCTION",
            "timestamp": "2025-05-06T12:09:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg10_chunk1",
        "text_to_embed": "CAPACITY CONTROL: The capacity of the blower may be varied by changing the blower speed, however confirmation of the input power and maximum speed must be taken from the manufacturer before making any alteration. Flow rate can be reduced by lowering the blower speed. It is a power saving option. This can also be done on the other end, by venting out the extra air to the atmosphere. Refer fig. 5 Caution: Never use valve on wither suction or discharge line to throttle the line for capacity / flow control. Figure 5: Throttling at the Inlet or Outlet to Vary Air Flow may Damage the Blower.  To Vary Air Flow either vent out the excess Air into Atmosphere or Change the Blower speed",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 10,
            "heading": "CAPACITY CONTROL",
            "timestamp": "2025-05-06T12:13:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg11_chunk1",
        "text_to_embed": " GENERAL LAYOUT FOR AERATION SYSTEM: The system layout should be designed in such a way that in any case the back flow should not occur due to gravity towards the blower. Do not rely on NRV as it is provided to restrict the air flow only in the backward direction (i.e. towards to blower), when connected in parallel.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 11,
            "heading": " GENERAL LAYOUT FOR AERATION SYSTEM",
            "timestamp": "2025-05-06T11:48:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg12_chunk1",
        "text_to_embed": "LUBRICATION:  Beta blower is designed for both-end-oil-lubrication which in turn gives better limiting speed for blower, excellent bearing life and less temperature rise due to low frictional losses. A good grade industrial type rust, oxidation and foam inhibited non detergentgear oil (of medium viscosity) is recommended. Oil level indicator is provided on both sides of oil covers to monitor the level of oil at any time. The oil should be periodically checked and fresh oil should be added as required to maintain proper level. Lubrication Schedule: For sulphur base gear oil / normal gear oil - first oil change at 200 operating hours & subsequent oil change at every 2500 operating hours. For synthetic oil - first oil change at 750 operating hours & subsequent oil change at every 6000 operating hours or earlier, based on service condition. During scheduled oil change, old oil should be completely flushed out before putting new oil. Recommended Lubricant: We recommend lubricating oil SP-320 of Indian Oil (IOCL) make. However, other lubricants having similar characteristics can also be used. Oil Characistics: The oil has a kinematic viscosity between 320 and 350 CST at 40°C, meaning it is relatively thick and flows slowly at that temperature. Its viscosity index is 90, which indicates moderate stability in thickness across different temperatures.The flash point is 232°C, showing the oil can withstand high temperatures before it starts to vaporize and ignite.The pour point is -9°C, meaning it remains usable and pourable down to this cold temperature.It has a colour rating of 8.0 on the ASTM scale, suggesting it is dark in appearance.The oil is required to pass the rust test, ensuring it won't contribute to corrosion or rust formation.It can be safely used in operations with temperatures reaching up to 105°C.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 12,
            "heading": " LUBRICATION",
            "timestamp": "2025-05-06T12:34:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg13_chunk1",
        "text_to_embed": "It has a colour rating of 8.0 on the ASTM scale, suggesting it is dark in appearance.The oil is required to pass the rust test, ensuring it won't contribute to corrosion or rust formation.It can be safely used in operations with temperatures reaching up to 105°C. Some alternative Gear Oil: Indian Oil offers SP-320 as its sulphur-based gear oil and Servo Syn. Gear 220 as its synthetic alternative.Bharat Petroleum provides Energol - 220xp as its sulphur-based gear oil with no synthetic alternative listed.Castrol supplies Alpha - 220 in the sulphur-based category, also without a corresponding synthetic variant mentioned.Shell and Valvoline offer EP - 320 as their sulphur-based gear oil and G.T.-220 as their synthetic gear oil option. Attention: We recommend Synthetic Base Gear Oil for Blower having working temperature more than 105°c.  A weekly checkup of the oil conditions and the level under normal working condition, ensures longer blower life.  Oil level sight glass : Both end oil level must be at the centre of the sight glass. Refill the oil as the level approaches the low oil level; never overfill. Caution: Over filling of oil will cause excessive heating of gear and entry of oil in the blower chamber. Both lead to either machine failure or system failure.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 13,
            "heading": "LUBRICATION",
            "timestamp": "2025-05-06T12:38:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg14_chunk1",
        "text_to_embed": "CHECK LIST AFTER INSTALLATION OF THE BLOWER: 1. Check the level & tightening of base frame on the foundation. 2. Check the level & fixation of blower on the base frame. 3. Blower must run freely by hand. 4.  Check all the connection and pipeline alignment. 5. Check the pipeline support. 6. Check the electrical connections. 7. Check the motor date. 8. Check the motor shaft /motor pulley rotation. 9. Check the alignment of pulley and tension of the belt. 10. Availability of recommended oil for blower at the site. 11. Check the fitting of safety valve, Pr. gauge and direction of NRV in the system. 12. Check setting of safety valve for Pr. Condition. 13. Differential pressure must be matched with the data mentioned on name plate of the blower in operating condition. Blower Startup Checklist: Following procedures are recommended when the blower is to be started, for the first time or the blower is put to operation after any major repair work or the blower is removed from its foundation. 1.  Check oil level of both chamber. 2. Inspect the interior of the blower for any rusting, the piping in suction and discharge line to ensure that all the foreign particles have been removed. 3. Check the alignment and tension of V-belts. 4. Rotate Rotor by hand to ensure free run. 5.  On/Off the motor two or three times by putting the starter in and out quickly to check the direction of rotation and also to ensure that the rotor run freely. 6. Start the unit for 15 min with no load. During this check for abnormal noise and other indications of interference. 7. Apply the load gradually and observe the unit for one hour. Check frequently for abnormal noise / over heating / overloading during the first day of operation. In case of any abnormal condition, do not continue to operate otherwise serious damage my result in a very short time. 8. Readjust the tension of V-belts after 2-3 days of operation & every belt change / installation.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 14,
            "heading": "CHECK LIST AFTER INSTALLATION OF THE BLOWER",
            "timestamp": "2025-05-06T12:55:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg15_chunk1",
        "text_to_embed": "Maintenance: Planned Preventive Maintenance (PPM): - Now a days PPM has become a proven tool for long life and trouble free operation cycle of any equipment. We also recommend following PPM routines to be undertaken. ROUTINE CHECK UP AND SERVICING TO BE CARRIED OUT: A. Weekly or 100 Hrs. of Operation (whichever is earlier) : 1. If the oil level falls below the red mark (half of the sight glass), the oil chamber should be refilled with the correct grade of oil up to the red mark. 2. When the V-belts start wearing out, the entire set must be replaced—never change only a few belts; refer to Page 10 for details. 3. If oil leakage is seen at joints or seals, it should be addressed by following the troubleshooting guide.4. When discharge pressure deviates from the specified operating condition, troubleshooting is required to identify and fix the issue. 5. Any abnormal sound during operation also calls for referring to the troubleshooting procedure. B. 1000hrs : 1. If air is either venting or not venting properly from the safety valve, the valve spring setting should be corrected or system pressure should be checked. 2. If the filter element is dirty, it must be cleaned or replaced—avoid using a water jet and instead use compressed air. 3. If the belt is found to be loose, adjust it properly or replace the full set of belts as instructed on Page 10. Caution: Do not to Dismantle or Re-adjust the internal Clearances without consulting Beta Service Team",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 15,
            "heading": "ROUTINE CHECK UP AND SERVICING TO BE CARRIED OUT",
            "timestamp": "2025-05-06T13:15:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg16_chunk1",
        "text_to_embed": "TROUBLESHOOTING: 1. If there is no air flow, it might be due to speed being too low, wrong direction of flow, or obstruction in piping. The remedy is to check speed and verify as per specification, check the correct direction of rotation, and inspect suction and discharge lines for any obstruction. 2. For low capacity, probable causes include speed too low, clearance disorder, excessive pressure, or discharge line leakage. Remedies are to check speed and belt tension for slippage, set proper clearance, check the line pressure, and check up for open flow path. 3. Excessive power consumption of blower may occur due to speed being too high, too high differential pressure, blockage of air intake filter, partially closed valve or blockage in delivery line causing excessive pressure, or impeller rubbing. Remedies include correcting speed, correcting line pressure, checking and clearing the filter and silencer, and resetting timing.4. Overheating of bearing, gears and blower could result from inadequate lubrication, too high differential pressure, belt non-alignment or loose belt, coupling non-alignment, too much oil in gear case, or worn impeller/high internal clearance. Remedies include checking oil condition and level, replacing the oil if required, checking the pressure and correcting it if needed, cleaning the filter and silencer, checking coupling and belt alignment, replacing the impeller, and resetting clearance. 5. Vibration may be caused by drive misalignment, impeller rubbing (in casing or between impeller), worn bearing/gear, loose pulley, dust deposition in rotor core hole, unbalanced pulley, or drive shaft bending/misalignment. Remedies include checking alignment, checking rubbing spot, checking gear condition for backlash, checking bearing condition and replacing bearings/gears if required, checking pulley fitment (loose pulley will create vibration), cleaning the rotor, and rechecking balancing.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 16,
            "heading": "TROUBLESHOOTING",
            "timestamp": "2025-05-06T13:35:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg16_chunk2",
        "text_to_embed": "impeller rubbing (in casing or between impeller), worn bearing/gear, loose pulley, dust deposition in rotor core hole, unbalanced pulley, or drive shaft bending/misalignment. Remedies include checking alignment, checking rubbing spot, checking gear condition for backlash, checking bearing condition and replacing bearings/gears if required, checking pulley fitment (loose pulley will create vibration), cleaning the rotor, and rechecking balancing. Also, check the chances of deposit gas in lobe hole. 6. If the symptom is that the Blower fails after running for a short period (i.e. seizure), the probable cause could be insufficient axial clearance, over heating due to top rubbing of Internal parts, too high differential Pr., or Misalignment of drive or pipeline connections, with the remedy being to Re-adjust internal clearance, Verify differential pressure and carry-out necessary adjustment, and Correct Misalignment. 7. For a Knocking sound (i.e. abnormal sound) or (noisy operation), the probable causes are that the Timing is out, Distortion due to improper mounting, or Worn bearing/gear, and the remedy is to Re-adjust timing, noting that It should be done in presence of βeta representative, and to Change Gear/bearing if required. 8. For Oil leakage, the table breaks it down by location: 1. Through oil filling hole or 2. Through air vent hole, both of which have Excessive oil level as the probable cause and Correct oil level as the remedy; while 3. Outside the blower through oil seal indicates a Damaged oil seal as the probable cause, requiring you to Replace oil seal as the remedy.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 16,
            "heading": "TROUBLESHOOTING",
            "timestamp": "2025-05-06T13:37:12.831121+00:00"
        }
    },
    {
        "id": "O&M_Blower_pg17_chunk1",
        "text_to_embed": "STORAGE OF BLOWER: All Beta Blowers are packed at factory with adequate protection to permit normal storage upto 45 days. If the equipment is to be stored for extended period following measures should be taken to prevent possible damage:Store the Blower in a clean and dry area. Put some (approx 15% of casing volume) lubricating oil inside the casing and make sure that inlet and outlet ports are tightly closed to prevent the entry of foreign materials inside the casing. To prevent rusting of gears and bearing inside the blower, the oil reservoirs should be filled with normal lubricating oil.Proper protection is to be provided to avoid any accidental mechanical damage. Spray anti rust at input shaft near the oil seal. Rotate the input shaft 10 to 15 turns fortnightly during storage. Before putting the blower into operation, drain all oil and refill upto theproper operating level with recommended lubricant.",
        "metadata": {
            "source_document": "O&M_Blower",
            "page_number": 17,
            "heading": "STORAGE OF BLOWER",
            "timestamp": "2025-05-06T13:39:12.831121+00:00"
        }
    }
]