[
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 1,
    "text_chunk": "These include problems with equipment design, fabrication, installation, maintenance, and misuse. Prob- lems with the equipment reliability program are also identified/categorized under this node. Typical Recommendation See lower level nodes. Example A spill to the environment occurred because a valve failed. The valve failed because it was not designed for the environment in which it operated."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 2,
    "text_chunk": "Problems related to the running of the plant/process are identified/categorized under this node. This includes the administrative/management systems to control the process (e.g., standards, policies, proce- dures), training of personnel, communications, and communications among individuals and groups. Typical Recommendation See lower level nodes. A tank overflowed, resulting in a spill to the environment. The operator filling the tank was using the wrong revision of the procedure, which had an incorrect calibration chart for the tank. A mechanic doing maintenance in a confined space was not allowed to take a written procedure with him. As a result, he had to review the procedure and commit it to memory. During performance of the task, he omitted an important step. This resulted in the failure of a key piece of equipment. An operator made a mistake performing a calculation. The data used in the calculation came from multiple steps in the procedure. He made a mistake in transferring one of the data points from an earlier step in the procedure to the step at which the calculation was performed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 3,
    "text_chunk": "These include problems related to natural phenomena, sabotage, external events, and events that cannot be categorized elsewhere. Typical Recommendation See lower level nodes. Examples Inventory in the warehouse was damaged when the warehouse was flooded following a heavy rain. A mechanic intentionally damaged a lathe. He was disgruntled about being placed into a new assignment. A release of chlorine from an adjacent facility affected the operators in your facility."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 4,
    "text_chunk": "These include problems related to the design process, problems related to the design and capabilities of the equipment, and problems related to the specification of parts and materials. Typical Recommendation See lower level nodes. A valve failed because the designer used obsolete materials requirements. A process upset occurred because one of the flow streams was out of specification. The design input did not indicate all the possible flow rates for the process. The pump was incorrectly sized for the necessary flow requirements. A line ruptured because a gasket failed. The gasket was constructed of the wrong material because the design did not consider all the possible chemicals that would be in the line during different operating condi- tions. A chemical that was not considered caused the gasket to fail."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 5,
    "text_chunk": "These include problems related to the design and implementation of the maintenance program. Was the wrong type of maintenance specified for the equipment? Are there problems with the analysis process used to determine the appropriate maintenance requirements? Are there problems related to performing the maintenance activities? Are monitoring activities implemented to detect deteriorating equipment? Does the repair activity cover the required scope? Typical Recommendations  Improve equipment operational and maintenance records to enable selection of the proper type of maintenance  Assign additional resources to equipment with a demonstrated history of problems  Reduce maintenance on equipment that has no significant impact on production or safety and that can be easily repaired or replaced  Provide maintenance procedures and training appropriate to the experience level of personnel During the past year, the failure rate for the feed pumps has doubled. Maintenance records are inadequate to determine why any of the failures occurred. Work records just say pump repaired. A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, there is no requirement for monitoring of the pump bearings. As a result, the predictive maintenance activity was never implemented. Preventive maintenance (a calibration) was being performed on a product scale every 3 months. However, operators requested additional calibrations about once per month as they noticed the scale drifting. The frequency of the calibration was changed to once per month."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 6,
    "text_chunk": "These include problems with the fabrication and installation of equipment. Was the equipment fabricated to the design specifications? Was there a problem with the installation? Was a field modification performed that altered the performance of the equipment? Develop fabrication procedures to help ensure that the fabricated equipment meets design specifica- tions Involve design personnel in field reviews of the fabrication and installation of equipment  Allow field fabrication and installation personnel to have access to design personnel to resolve prob- lems encountered in the fabrication and installation process A pipe needed to be rerouted during installation to go around existing equipment, but this was not on the layout drawing. The reroute created a low point in the line that allowed contaminants to accumulate. Later, the pipe failed in this low section. Field personnel could not determine from the installation package how to connect the power to a new drill press. They decided to connect it the same way the others in the facility were connected even though this drill press had a different manufacturer than the rest. As a result of the incorrect connection, the drill press control system was damaged. A walkway collapsed because a field modification of the suspension system resulted in a weakened support system. The walkway collapsed when it was full of people."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 7,
    "text_chunk": "Was equipment used for an activity other than it was intended? Was the equipment used beyond its capac- ity?  Ensure that proper equipment is available for personnel to use  Ensure that personnel are aware of the proper use of equipment To save money, a drill press was purchased to mix chemicals in a lab. The slowest speed on the drill press was still too fast for proper mixing of materials. As a result, technicians were routinely splattered with chemicals while using the drill press. A technician in the field ran out of a water-based cleaner. Someone nearby was using gas to run a lawn mower. Instead of going back to the truck to get the water-based cleaner, the technician put some gas on a rag and used it. The operators hair was burned when the rag contacted a hot bearing, starting a fire."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 8,
    "text_chunk": "Was a company employee involved? Are the employees involved covered by the normal company training programs? Are they supervised directly by company employees? Note: Distinguishing between company and contract employees can be important because of the different management systems that control the work performed by these two groups. Typical Recommendation See lower level nodes. A company employee took a sample from product tank C instead of product tank B. The tanks are arranged from left to right: A C B. A company employee made a mistake using a scale to weigh a pallet of material. It was the first time the operator had used the scale. He was told how to use the scale as part of training, but had never actually used it himself."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 9,
    "text_chunk": "Was a contract employee involved? Was the person involved a transient worker in your facility? Was the person involved covered by the contract employee training program? Is the person involved directly super- vised by someone who does not work for your company? Does this person have to meet different require- ments than a regular employee? Note: Distinguishing between company and contract employees can be important because of the different management systems that control the work performed by these two groups.  Ensure that contract employees have sufficient guidance to perform their activities  Ensure that work documents used by contract employees have sufficient detail to allow individuals inexperienced with your operations and work methods to adequately perform the job A worker for the local vending company entered the facility to refill the vending machines. The individual was not aware of the requirement to wear a hard hat and safety goggles in the aisle way that led to the lunchroom. A contract mechanic installed the wrong type of gasket in a line during a scheduled maintenance activity. As a result, the line failed when the process was restarted. The procedure did not specify the proper material to be used. The in-house mechanics all knew the proper material, and, therefore, it had never been a problem even though it was not specifically covered in the procedure."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 10,
    "text_chunk": "Problems that result from tornadoes, hurricanes, earthquakes, lightning, floods, or other natural phenomena are identified under this node.  Ensure that natural phenomena are considered in the design process  Ensure that natural phenomena are considered in the development of procedures and training  Ensure that risk acceptance criteria are properly set for natural phenomena events A process upset occurred in the facility because power was lost as a result of lightning striking a trans- former. The plant site was flooded when the river overtopped the levee designed for a 100-year flood."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 11,
    "text_chunk": "Malicious acts that cause or contribute to an incident are identified under this node. Malicious lack of action that contributed to a problem is also identified under Sabotage. Was the event the result of horseplay or other nonwork-related activities? Note: Dual coding under Personal Performance or Administrative/Management Systems may be appropri- ate. The problem that led the employee to commit sabotage/horseplay should be addressed.  Ensure that security plans and equipment are adequate  Ensure that inappropriate behavior, such as horseplay, is addressed and corrected by management and supervision A mechanic intentionally damaged a piece of equipment. He was disgruntled about being placed in a new assignment. As a practical joke, operators sent a junior operator to check out the electrical zerts (there are no such things) on the generator. As a result of trying to find the electrical zerts, the junior operator accidentally shut down the generator."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 12,
    "text_chunk": "Was the event a result of problems at adjacent facilities? Was it the result of activities outside the facility that are not under your control? Note: Coding under Administrative/Management Systems; Safety/Hazard/Risk Review may also be appro- priate. Coordinate emergency response and planning with nearby facilities  Develop contingency actions for external events A chlorine tanker accident on a nearby railroad spur requires the evacuation of a portion of your facility. A nearby accident on the expressway prevents shipments from leaving your facility for an 8-hour period. As a result, some deliveries are not made on time. A key suppliers warehouse was struck by a tornado. As a result, the warehouse was unable to supply your facility with raw materials for a period of 2 weeks. The local utility's power plant shut down, resulting in a 5-minute power outage to your facility. It took 2 hours to restart the plant and stabilize the process."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 13,
    "text_chunk": "These include issues that cannot be coded elsewhere on the map (e.g., problems that cannot be coded because of insufficient information).  Analyze the causal factors that are coded under this node. Determine if additional nodes should be added to the map to categorize these issues  Determine methods for gathering additional information for this type of event when it recurs A customer complained that the materials sent to him were out of specification. However, when the lab sample was tested, it was acceptable. When the customer retested the material, his test also indicated the material was acceptable. Product manufactured from this batch was also acceptable. A spurious shutdown of a computer in the order receiving department caused a delay in handling a customers request. The problem could not be recreated. It could not be determined whether it was equip- ment failure or human error that led to the shutdown. A rabid fox bit a worker who was checking some equipment in a remote location."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 14,
    "text_chunk": "Were all the appropriate design inputs considered during the design phase? Was the design output, such as drawings and specifications, complete? Was the design input and output consistent and complete? Did the design review process fail to detect errors? Was the design review independent? Typical Recommendations * Conduct a feasibility review prior to beginning design to ensure that the criteria can be met and that no conflicting criteria exist * Develop a pre-construction planning and review process to help ensure that all the specifications are in agreement Examples A valve failed because equipment conditions during operation, such as corrosivity, were not considered during design. A pump failed to deliver enough cooling water in an emergency because emergency requirements were not considered in the design."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 15,
    "text_chunk": "Were all the appropriate design inputs considered during the design phase? Were the design criteria so stringent that they could not be met? Were some criteria conflicting? Were requirements out-of-date? Were the wrong standards or bases used? Were the necessary codes and standards available to the designer? Conduct a feasibility study prior to beginning design to ensure that the criteria can be met and that no conflicting criteria exist  Develop an independent review process to help ensure that appropriate standards are used in the design  Develop a tracking system to help ensure that design problems and conflicts are resolved prior to startup  Develop a tracking system to help ensure that current design criteria are used Develop comprehensive system design requirements A valve failed because the designer used obsolete materials requirements. A process upset occurred because one of the flow streams was out of specification. The design input did not indicate all the possible flow rates for the process. The pump was incorrectly sized for the necessary flow requirements. An engineer did not account for all types of vehicles that would be required to enter the plant in the design of the new guard house and gate. As a result, some of the outside responders fire trucks can no longer enter the plant because they are wider than the new entrance. A flow controller could not adequately control flow during an infrequent operation. The flow requirements for normal, emergency, and infrequent operation covered too wide a range for a controller to operate properly under all of the conditions."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 16,
    "text_chunk": "Was the design output, such as drawings and specifications, complete? Were all operating conditions (normal, startup, shutdown, emergency) considered in the design? Were the design documents difficult to read or interpret? Did the final design output include all changes? Were there differences between different output documents? Did the design output address all requirements specified in the design input? Include satisfaction of design input criteria as a specific review team item during design reviews  Include experienced operations and maintenance personnel in design reviews to help ensure that all possible operating conditions are considered in the design  Include designers in construction and pre-startup reviews to help ensure that design information is properly interpreted Conduct an independent technical review of the final design to help ensure consistency among vari- ous design documents A valve failed because the material specifications were incorrect. The specifications did not agree with the design criteria. The criteria stated that the valve must operate in a corrosive environment, but the specifica- tions did not indicate this condition. Therefore, the valve was constructed of improper materials. A line ruptured because a gasket failed. The gasket was constructed of the wrong material because the design did not consider all the possible chemicals that would be in the line during different operating condi- tions. One that was not considered caused the gasket to fail. A pump did not provide the necessary cooling water during an emergency. The pump was sized incorrectly because the final design specifications did not include changes identified in the safety analysis."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 17,
    "text_chunk": "Does an equipment records program exist? Is it adequate and up to date? Does it contain the correct information? Does it contain all the information necessary to ensure equipment reliability? Develop a system for tracking equipment histories  Collect information from other sources (e.g., vendors) to help complete existing equipment histories A tank overflowed because of faulty liquid level instrumentation. The records indicated that a calibration was called for and performed 3 months prior, but did not indicate how much adjustment was made during calibration. A large adjustment might have indicated pending failure. A pressure vessel was not properly tested after a modification. The design information for the salvaged vessel had been lost."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 19,
    "text_chunk": "Was the history for the equipment that malfunctioned complete? Did the history contain information about similar equipment? Would knowledge of the history of the equipment involved in the event and similar equipment have prevented the incident or lessened its severity? Collect available information from other sources (e.g., vendors) to help complete existing equipment histories  Improve the system for tracking equipment histories to help ensure that all pertinent information is retained  Assign responsibility for maintaining and analyzing equipment repair and maintenance records Periodically audit the equipment history files to help ensure that the records system is being followed  Assess adequacy of operator rounds and the information collected on rounds  Assess adequacy of maintenance tasks that collect information on the status of equipment  Ensure that information collected on rounds is analyzed to determine if problems exist with equipment A tank overflowed because of faulty liquid level instrumentation during a nonroutine mode of operation that failed the level device. Previous problems had occurred with the instrumentation under these conditions. This was not known by current personnel because no equipment history was available. A flow meter in a product line failed, resulting in the wrong amount of material being sent to a customer. Records indicated that calibration of the flow sensor had been performed three times in the last month, but did not indicate how much adjustment was made during calibration. A large adjustment, or larger adjust- ments each time, might have indicated a pending failure. Operators routinely performed rounds twice each shift. However, there were no guidelines provided on what to look for or what data to document. Following a number of pump failures, the equipment logs were reviewed to determine what was causing the failures. Although the operators had looked at the pumps each shift, they had not collected any operating history on them."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 20,
    "text_chunk": "These include problems related to the design and implementation of the maintenance program. Was the wrong type of maintenance specified for the equipment? Are there problems with the analysis process used to determine the appropriate maintenance require- No Program ments? Improve equipment operational and maintenance records to enable selection of the proper type of maintenance Assign additional resources to equipment with a demon- strated history of problems Reduce maintenance on equipment that has no significant impact on production and that can be easily repaired or replaced Inappropriate Type of Maintenance Assigned Risk Acceptance Criteria LTA Maintenance activities had been specified for the running compo- nents of a wood chipping machine (i.e., bearings, blades) but no maintenance activities had been specified for the safety interlocks associated with the machine. The analysis procedure did not require safety interlocks to be addressed. As a result, an operators arm was amputated when it was caught in the chipper and the auto stop feature failed. A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, there is no requirement for monitoring of the pump bearings. Corrective maintenance was assigned to an auger that provided raw materials to a food process. This selection was based on a very low expected failure rate and a quick repair time. Actual experience indicates the failures took much longer to repair than the analysis team estimated. As a result, the risk associated with the failures was much higher than the team thought."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 21,
    "text_chunk": "Does an equipment reliability program exist for this piece of equipment? Have the maintenance needs for this piece of equip- ment been analyzed? Note: If the maintenance needs were analyzed and it was deter- mined that no maintenance was appropriate, code this under Program LTA (Equipment Reliability Program Design LTA). Typical Recommendation  Determine the appropriate level of maintenance for all equipment in the facility that is important to safety or reli- ability Example Hydraulic hoses on the forklifts in the facility were failing once every 2 months. A review of the maintenance program records indicated that proper maintenance for these hoses had never been determined."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 22,
    "text_chunk": "These include problems related to the design and implementation of the maintenance program. Was the wrong type of maintenance specified for the equipment? Are there problems with the analysis process that is used to determine the appropriate maintenance requirements?  Ensure that the proper level of risk acceptance is used in determining the level and type of maintenance to perform on equipment  Ensure that the analysis process addresses all aspects of equipment operation important to safety and reliability  Improve equipment operational and maintenance records to enable the selection of the proper type of maintenance Assign additional resources to equipment with a demon- strated history of problems Reduce maintenance on equipment that has no significant impact on production or safety and that can be easily repaired or replaced Maintenance activities had been specified for the running compo- nents of a wood chipping machine (i.e., bearings, blades) but no maintenance activities had been specified for the safety interlocks associated with the machine. The analysis procedure did not require safety interlocks to be addressed. As a result, an operators arm was amputated when it was caught in the chipper and the auto stop feature failed. A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, there is no requirement for monitoring of the pump bearings. Corrective maintenance was assigned to an auger that provided raw materials to a food process. This selection was based on a very low expected failure rate and a quick repair time. Actual experience indicates the failures took much longer to repair than the analysis team estimated. As a result, the risk associated with the failures was much higher than the team thought."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 23,
    "text_chunk": "These include problems related to the design of the maintenance program. Was the process used to determine maintenance tasks completed? Did the process address all equipment important to safety, reliability, and quality? Was the process consistently applied? Ensure that the analysis process addresses all aspects of equipment operation important to safety, reliability, and quality  Ensure that personnel are provided with sufficient guidance to select appropriate maintenance tasks for different types of equipment  Ensure that personnel who are responsible for developing the equip- ment reliability program have the proper training Maintenance activities had been specified for the running components of a wood chipping machine (i.e., bearings, blades) but no maintenance activities had been specified for the safety interlocks associated with the machine. The analysis procedure did not require safety interlocks to be addressed. As a result, an operators arm was amputated when it was caught in the chipper and the auto stop feature failed. Predictive maintenance had been selected for certain conveyors. However, no monitoring program was developed. The equipment reliability analysis program did not require that monitoring programs be developed when predictive maintenance was assigned."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 24,
    "text_chunk": "Was the wrong type of maintenance specified for the equipment? Should corrective maintenance be used instead of proactive maintenance? Should predictive maintenance be assigned instead of proactive maintenance?  Review equipment failure records to determine if the failures occur at specific intervals of operation or calendar time. Assign preventive maintenance tasks if the risk associated with equipment failure is high enough Determine if the failures can be predicted by monitoring a parameter (i.e., pump vibration, temperature, flow). Assign predictive mainte- nance tasks if the risk associated with equipment failure is high enough Determine if failures occur shortly after certain events (i.e., startup, shutdown). Assign proactive maintenance tasks if the risk associated with equipment failure is high enough  If other types of maintenance are not appropriate, or if the risk associ- ated with the failure is low enough, assign corrective maintenance Corrective maintenance was assigned to an auger that provided raw materi- als to a food process. This selection was based on a very low expected failure rate and a quick repair time. Actual experience indicates the failures took much longer to repair than the analysis team estimated. As a result, the risk associated with the failures was much higher than the team thought. Records indicated that tube failures were occurring in heat exchangers shortly after plant startup. The failures were determined to be caused by hot spots that developed when contaminants collected in portions of the heat exchanger. Proactive maintenance activities were implemented to clean out the system prior to startup. This removed the contaminants and prevented the heat exchanger failures."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 25,
    "text_chunk": "Were the wrong risk-acceptance criteria used for analyzing the maintenance needs? Was corrective maintenance assigned even though the consequences of failure are very high?  Ensure that the proper level of risk acceptance is used in determining the level and type of maintenance to perform on equipment  Provide guidance in the analysis procedure to allow consistent assess- ment of risk Provide guidance in the analysis procedure to allow for consistent application of the risk acceptance criteria. Use specific examples Corrective maintenance was assigned to a conveyor that provided raw materials to a food process. Experience indicated that failures took about 16 hours to repair. The analysis procedure did not consider repair times in the overall risk associated with a failure. The analysis team assigned predictive, proactive, and preventive mainte- nance activities to equipment with failures that resulted in large conse- quences. They assigned corrective maintenance to equipment with failures that had only low consequences. However, the risk associated with the low consequence, high frequency events was larger than that associated with some of the high consequence, infrequent events. The risk acceptance criteria outlined in the analysis procedure led them to believe that they were assigning the correct type of maintenance to these different types of risks."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 26,
    "text_chunk": "Are resources assigned based on the risk analysis? Are some high priority tasks not being accomplished because other low priority tasks are being implemented instead?  Ensure that resources are assigned in accordance with the priorities determined in the equipment reliability program analysis Assign additional resources to equipment with a demonstrated history of problems Reduce maintenance on equipment that has no significant impact on safety or production and that can be easily repaired or replaced Inappropriate Type of Maintenance Assigned Maintenance activities were being conducted for the running components of the wood chipping machine (i.e., bearings, blades) but no maintenance activities were being implemented for the safety interlocks associated with aLerauan the machine. The equipment reliability program required weekly checks of the interlocks. Risk Acceptance Criteria LTA Mechanics were always being pulled from scheduled work to work on emergencies. The percentage of corrective maintenance was 80%. This had not changed since the development of additional preventive, predic- tive, and proactive maintenance activities."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 27,
    "text_chunk": "Predictive Maintenance LTA Proactive Maintenance LTA Failure Finding Maintenance LTA Detection LTA Monitoring LTA Event Specification LTA Frequency LTA A Scope LTA Troubleshooting! Corrective Action LTA Scope LTA Monitoring Ti Troubleshooting/ Corrective Action LTA Activit Implementation 5 28 LTA Activity Implementation LTA Repair Implementation LTA Routine Equipment Rounds LTA Frequency LTA Scope LTA Activit Implementation ty LTA These include problems related to the implementation of maintenance activities. Was the repair incorrectly performed? Was the troubleshooting less than adequate? Did the monitoring activity fail to detect a failing component? Was maintenance performed when it should have been (i.e., following a shutdown, before a startup, when vibration readings reached a trigger point)?  Provide troubleshooting guides based on equipment failure analyses for diagnosis of failed compo- nents  Review the frequency of preventive maintenance. If the same activity routinely needs to be performed between scheduled intervals, shorten the preventive maintenance interval  Ensure that equipment monitoring for predictive maintenance is appropriate for the component Example A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, monitoring of the pump bearings was never per- formed even though it was identified as a requirement in the equipment reliability program. As a result, the pump failed before the predictive maintenance activity was implemented. Preventive maintenance (a calibration) was being performed on a product scale every 3 months. However, operators requested additional calibrations about once per month as they noticed the scale drifting. The frequency of the calibration was changed to once per month after the company was fined for shipping overloaded trucks."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 28,
    "text_chunk": "Was the problem misdiagnosed? Was the corrective maintenance repair performed correctly? Note: Dual coding under Training or Procedures may also be appropriate. Provide troubleshooting guides based on equipment failure analyses for diagnosis of failed compo- nents Review maintenance procedures to ensure that they provide adequate guidance based on the experi- ence level of personnel  Provide training for personnel on troubleshooting processes  Provide training for personnel on repair techniques  Perform post-maintenance testing to ensure that the maintenance is properly performed and corrects the problem Examples Mechanics job performance was judged by how many work requests they completed. As a result, they tried to diagnose the problem as quickly as possible. This led to rework when the original repairs failed to correct the problem. An inexperienced mechanic incorrectly repaired a pump seal, which subsequently leaked. He inserted one of the rubber seals backwards. The procedure provided no guidance other than to install the rubber seals."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 29,
    "text_chunk": "Was the problem misdiagnosed? Was the wrong problem corrected because the troubleshooting was less than adequate? Note: Dual coding under Training or Procedures may also be appropriate. Provide troubleshooting guides based on equipment failure analyses for diagnosis of failed components Provide training for personnel on troubleshooting processes  Perform post-maintenance testing to ensure the maintenance is properly performed and corrects the problem. Mechanics job performance was judged by how many work requests they completed. As a result, they tried to diagnose the problem as quickly as possible. This led to rework when the original repairs failed to correct the problem. The electricians were attempting to isolate a ground in a feeder circuit. They thought they had isolated the problem to a portion of the circuit, but they were mistaken. They had misread the electrical diagrams and misinterpreted their instrument readings."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 31,
    "text_chunk": "Was the frequency of the preventive maintenance correct (i.e., too long or too short)? Was the scope of the preventive maintenance activity appropriate (i.e., too broad or too narrow)? Was the activity incorrectly performed? Predictive Maintenance LTA Proactive Maintenance LTA Failure Finding Maintenance LTA Detection LTA Monitoring LTA Event Specification LTA A Monitoring LTA G Frequency Scope LTA Troubleshooting! Corrective Action LTA Scope LTA Troubleshooting/ Corrective Action LTA Activity Implementation LTA Activity Implementation LTA A A Repair Implementation LTA Routine Equipment Rounds LTA Frequency LTA Scope LTA Activity Implementation LTA Review the frequency of preventive maintenance. If the same activity routinely needs to be performed between scheduled intervals, shorten the preventive maintenance interval  Review maintenance procedures to ensure that they provide adequate guidance based on the experi- ence level of personnel  Provide training for personnel on preventive maintenance techniques Preventive maintenance (a calibration) was being performed on a product scale every 3 months. However, operators requested additional calibrations about once per month as they noticed the scale drifting. The frequency of the calibration was changed to once per month after the company was fined for shipping overloaded trucks. Preventive maintenance was being performed on a furnace every week to prevent a buildup of powdered material. However, only the main chamber was being cleaned. Portions of the furnace were not being cleaned, and, as a result, the performance of the furnace degraded over time."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 34,
    "text_chunk": "Was the preventive maintenance activity incorrectly performed? Were all required components serviced? Were some items included on the schedule that were never performed? Note: Dual coding under Training, Procedures, or Planning, Scheduling, or Tracking of Work Activities LTA (Administrative/Management Systems, SPACs LTA) may also be appropriate.  Review maintenance procedures to ensure that they provide adequate guidance based on the experience level of personnel Provide training for personnel on preventive maintenance techniques  Review the preventive maintenance schedule and completed work orders to ensure that all required activities are being performed  Perform post-maintenance testing to ensure that the maintenance is properly performed An inexperienced mechanic incorrectly installed a pump seal, which subse- quently leaked. He inserted one of the rubber seals backwards. The proce- dure provided no guidance other than to install the rubber seals."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 35,
    "text_chunk": "Did the monitoring activity fail to detect a failing component? Was the monitoring activity performed? Was the correct parameter being monitored to detect failure? Was the predictive maintenance incorrectly per- formed? Predictive ACCU aL Proactive Maintenance LTA Failure Finding Maintenance LTA Detection LTA Monitoring LTA Event Specification LTA A Monitoring LTA G Frequency Scope LTA Troubleshooting! Corrective Action LTA Scope LTA Troubleshooting/ Corrective Action LTA Activity Implementation LTA Activity Implementation LTA A A Repair Implementation LTA Routine Equipment Rounds LTA Frequency LTA Scope LTA Activity Implementation LTA Provide guidance on the typical parameters that can be monitored to predict failures for different types of components  Ensure that equipment monitoring for predictive maintenance is appropriate for the component  Ensure that equipment monitoring is being performed  Ensure that the scope of equipment monitoring is adequate A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, monitoring of the pump bearings was never per- formed even though it was identified as a requirement in the equipment reliability program. As a result, the pump failed before the predictive maintenance activity was implemented. Monitoring of a pump indicated an upcoming failure (e.g., from predictive maintenance monitoring). The pump was repaired incorrectly."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 36,
    "text_chunk": "Program Implementation LTA Did the monitoring activity fail to detect a failing component? Was the correct parameter being monitored to detect failure? Is there sufficient time to detect an impending failure before the failure actually occurs? Predictive Maintenance LTA Provide guidance on the typical parameters that can be monitored to ee predict failures for different types of components ala  Ensure that equipment monitoring for predictive maintenance is appropriate for the component Monitoring LTA Troubleshooting/ Corrective Action LTA Turbine bearing temperatures were being monitored to predict impending Activity failures. However, failures occurred even though there was no prediction of Impl tatir . > : : mA failure based on temperature levels. Vibration should have been monitored instead, because it was a better predictor of impending failures. Pump bearings were being monitored for failure. However, by the time the impending failure could be detected, there was insufficient time to perform the maintenance."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 37,
    "text_chunk": "Were monitoring activities being performed? Were all equipment and all components monitored? Ensure that equipment monitoring is being performed  Ensure that all pieces of equipment are being monitored * Ensure that all components (points) are being monitored A number of pump bearings have failed recently. Predictive maintenance was selected as the appropriate type of maintenance for the pump bearings. However, monitoring of the pump bearings was never performed even though it was identified as a requirement in the equipment reliability program. As a result, the pump failed before the predictive maintenance activity was imple- mented. The three supply fans for the assembly building were all supposed to be monitored for vibration as part of predictive maintenance. Only two of the three fans were being monitored. The third fan was difficult to access."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 38,
    "text_chunk": "Was the scope of the work appropriate? Did the maintenance address the problem? Was the scope broad enough to correct the problem? Note: Dual coding under Training or Procedures may be appropriate. Provide guidance on the typical failures that occur in various compo- nents Provide troubleshooting guides based on equipment failure analyses for diagnosis of failed components  Provide training for personnel on troubleshooting processes Perform post-maintenance testing to ensure that the maintenance is properly performed and that it corrects the problem Mechanics job performance was judged by how many work requests they completed. As a result, they tried to diagnose the problem as quickly as possible. This led to rework when the original repairs failed to correct the problem. High vibration readings generally indicated a bearing problem in the pump. The mechanics replaced the bearing even though it did not look worn or damaged. When the pump was restarted, the high vibration readings were still present. The pump impeller had been damaged and caused the high vibration. This was not considered as a potential cause of the high vibration."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 40,
    "text_chunk": "Was maintenance performed when it should have been (i.e., following a shutdown, before a startup, the beginning of winter)? Was the work incorrectly performed? Was the scope of the activity broad enough? . . . Ensure that triggering events for proactive maintenance are appropriate for the component Ensure that monitoring is performed to determine when triggering events occur Review maintenance procedures to ensure that they provide adequate guidance based on the experi- ence level of personnel Provide training for personnel on monitoring and maintenance techniques Review the proactive maintenance schedule and completed work orders to ensure that all required activities are being performed Product barrels were cleaned as they were returned from customers. However, some product was contami- nated by dust that accumulated in those barrels that were not used for an extended period of time. Cleaning was switched to shortly before use instead of when the barrels were returned from customers. Cranes were supposed to be inspected and lift-tested prior to lifting any item that was greater than 70% of the cranes rated capacity. These inspections and tests were never performed because the crane operators were unaware of this requirement. Furnace crucibles were to be cleaned whenever the furnace was scheduled to be shut down for more than 8 hours. Operations never told maintenance when the scheduled shutdowns would occur. As a result, the cleaning was not performed as required."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 42,
    "text_chunk": "Was a monitoring program in place to determine when these events oc- curred? Was maintenance notified when these events occurred? Ensure that monitoring is performed to determine when triggering events occur Review the proactive maintenance schedule and completed work orders to ensure that all required activities are being performed Cranes were supposed to be inspected and lift tested prior to lifting any item that was greater than 70% of the cranes rated capacity. These inspections and tests were never performed because the crane operators were unaware of this requirement. Furnace crucibles were to be cleaned whenever the furnace was scheduled to be shut down for more than 8 hours. Operations never told maintenance when the scheduled shutdowns would occur. As a result, the cleaning was not performed as required."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 43,
    "text_chunk": "Was the scope of the activity sufficient to prevent the problem? Review the scope of the proactive maintenance procedures to ensure that they are broad enough to address the issue  Perform post-maintenance testing to ensure that the maintenance is properly performed and corrects the problem Example At the end of the season, lawn mowers were supposed to be winterized to prevent damage while sitting idle over the winter. Maintenance changed the oil, but failed to stabilize the gas. As a result, the mowers fuel lines were gummed up in the spring when the mowers were brought out for use. Cranes were supposed to be inspected and lift tested prior to lifting any item that was greater than 70% of the cranes rated capacity. The lift tests were only performed at one boom angle even though they should have been performed at a number of different boom angles."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 44,
    "text_chunk": "Did hidden failures contribute to the loss event? Could these hidden failures have been detected by testing the equipment? Troubleshooting/ Scope LTA Corrective Action Hoe ag A Note: This type of maintenance is usually applicable to standby systems or the detection of hidden failures in systems.  Ensure that standby systems are periodically tested to determine their operability Verify that installed spares are periodically used to ensure that they are ready to operate when the primary components or trains fail Check fault-finding testing procedures to ensure that they test the entire system and not just a portion of it Ensure that the frequency of testing is correct (not too often, but often enough) A standby diesel generator was installed to provide power to vital components during a loss of power. No testing had been performed on the diesel generator since it was installed. As a result, when there was a loss of power, the diesel generator did not work. A second cooling pump is installed as a spare. It is designed to start when the primary pump fails. The standby pump is smaller than the primary and so it is seldom used. The pump is tested when it is periodi- cally placed in service (although this is not done on any schedule). However, the autostart system is never tested. As a result, the standby pump failed to start following an emergency shutdown of the primary pump. Routine testing of a computer backup power supply (an uninterruptible power supply with batteries) was performed once a year. However, the batteries had an expected lifetime of 18 months. As a result, many of the battery failures were not detected for months after they occurred. EQUIPMENT RELIABILITY PROGRAM IMPLEMENTATION LTA Equipment Reliability Program Implementation LTA Failure Finding Maintenance LTA Page rae is Repair LT."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 46,
    "text_chunk": "Was the frequency of fault-finding maintenance correct? Was the mainte- nance performed too frequently? Was it not performed often enough? Note: This type of maintenance is usually applicable to standby systems or the detection of hidden failures in systems.  Ensure that standby systems are periodically tested to determine their operability  Ensure that the frequency of testing is correct (not too often, but often enough) Assess the impact of fault-finding maintenance on the system. What impact does the maintenance have on the equipment? Adjust the frequency accordingly A standby diesel generator was installed to provide power to vital compo- nents during a loss of power. No testing had been performed on the diesel generator since it was installed. As a result, when there was a loss of power, the diesel generator did not work. Routine testing of a computer backup power supply (an uninterruptible power supply with batteries) was performed once a year. However, the batteries had an expected lifetime of 18 months. As a result, many of the battery failures were not detected for months after they occurred. An important control system in a nuclear power plant was tested daily to detect hidden failures. The test took about an hour to perform. As a result, the system was inoperable about 5% of the time for scheduled maintenance. In addition, the maintenance often introduced problems into the system that rendered it inoperable. The test frequency was modified so that it was per- formed once per week."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 47,
    "text_chunk": "Did the testing include all applicable portions of the system (i.e., detection system, control systems, actuation systems, and the actual components)? Note: This type of maintenance is usually applicable to standby systems or the detection of hidden failures in systems. Check fault-finding testing procedures to ensure that they test the entire system and not just a portion of it. Check to see that the following portions of the system are included:  detection systems (i.e., a system that detects low voltage to start an emergency generator)  actuation systems (i.e., the part of the system that tells the standby component to start)  the component itself (i.e., the diesel generator) Example A second cooling pump is installed as a spare. It is designed to start when the primary pump fails. The standby pump is smaller than the primary and so it is seldom used. The pump is tested when it is periodically placed in service (although this is not done on any schedule). However, the autostart system is never tested. As a result, the standby pump failed to start following an emergency shutdown of the primary pump."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 48,
    "text_chunk": "Was the scope of the repairs appropriate? Did the repair correct the problem? Was the scope of the repair broad enough to correct the problem?  Provide guidance on the typical failures that occur during testing  Provide troubleshooting guides based on equipment failure analyses for diagnosis of failed components  Provide training for personnel on troubleshooting processes  Perform post-maintenance testing to ensure that maintenance was properly performed and corrects the problem Example During testing, a standby generator failed to start. Troubleshooting revealed a failure in the starting circuit. No post-maintenance testing was performed. As a result, a failed fuel line was not discovered."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 49,
    "text_chunk": "Was an error made in performing the repair activity? Were problems intro- duced as a result of performing the repair? Were hidden failures introduced into the system as a result of performing the maintenance? Note: This type of maintenance is usually applicable to standby systems or the detection of hidden failures in systems. Dual coding under Training, Procedures, or Planning, Scheduling, or Tracking of Work Activities LTA (Administrative/Management Systems, SPACs LTA) may also be appropriate.  Review maintenance procedures to ensure that they provide adequate guidance based on the experience level of personnel  Provide training for personnel on repair techniques Perform an analysis of procedures to determine the types of errors that could be reasonably made. Ensure that the procedures adequately address each of these A standby diesel generator (DG) was installed to provide power to vital components during a loss of power. To perform testing of the DG, the mainte- nance technician takes the DG off-line. After testing, maintenance failed to return the DG to an on-line condition. As a result, when there was a loss of power, the diesel generator did not work. A secondary cooling pump is installed as a spare. It is designed to start when the primary pump fails. A failure in the autostarting system was found during a test. However, the pump was not repaired for several weeks because it was not put on the maintenance schedule. When the primary pump tripped, the secondary pump was still inoperable."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 50,
    "text_chunk": "Are routine inspections of equipment performed? Are personnel aware of the types of problems they should look for? Do they know how to document the problem and feed it into the maintenance system? Develop guidance for operator and maintenance rounds  Ensure that personnel are aware of the process for initiating corrective maintenance * Make the process of reporting problems as simple as possible to encourage reporting problems Examples Operators are supposed to inspect the line for problems at the beginning of each shift. Often the operators skip the rounds because they have too much paperwork to complete. Grounding straps on a pipeline were to be inspected once per year. Most of the line was inspected yearly, but portions that were difficult to access were frequently skipped."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 51,
    "text_chunk": "Was the frequency of the rounds correct (i.e., too often or not often enough)? Routine Equipment Rounds LTA. Typical Recommendation Review the frequency of the rounds to determine if they are performed at the required frequency reer ft A Example Operators performed equipment rounds in some areas of the plant only once Activity a day. Frequently, significant valve packing leaks were found by the operators. Implementation More frequent rounds resulted in detections of leaks while they were still very small."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 52,
    "text_chunk": "Was the scope of the rounds appropriate (i.e., too broad or too narrow)? Are all portions of the plant covered by routine rounds? Typical Recommendations  Ensure that all areas of the plant are covered by periodic rounds  Provide guidance on the activities that are to be performed during routine rounds Operators were told to perform rounds in the steam plant but were not told what activities they were to perform. As a result, the operators poked their head in the door of the building and glanced around, but did nothing else. A plant was recently automated. The operators did not need to leave the control room to operate the plant. The operators only toured the area right around the control room. As a result, no one routinely toured the entire plant."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 53,
    "text_chunk": "Are the rounds performed? Are they performed at the specified frequency? Do the rounds cover all areas that are specified? Typical Recommendations * Ensure that rounds are performed as required  Ensure that all equipment is covered on rounds as required Example Operators are supposed to check for leaks in various portions of the plant. However, they usually only toured the part of the plant that was between the control room and the lunch room. EQUIPMENT RELIABILITY PROGRAM IMPLEMENTATION LTA ApPENDIX A  Root Cause Map Nope Descriptions no PTL Tene onc ecu Standards, Policies, or Administrative Controls [SPACs] LTA Not Strict Enough Confusing, Contradictory, or Incomplete Technical Error Responsibility for Item/Activity Not Adequately Defined Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA Employee Screening/Hiring LTA Standards, Policies, or Administrative Controls [SPACs] Not Used Communication of SPACs LTA Recently Changed Enforcement LTA Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Not Yet Implemented Risk Acceptance Criteria LTA Review Procedure LTA Problem Identification/ Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA Corrective Actions Not Yet Implemented Product/ Material Control Handling Storage Packaging/ Shipping LTA Unauthorized Material Substitution Product Acceptance Criteria LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 55,
    "text_chunk": "Do standards, policies, or administrative controls (SPACs) exist? Are they inadequate or inadequately imple- mented? Did inadequate material, procurement, or configuration control contribute to the problem? Are safety/hazard reviews inadequate? Are corrective actions identified and implemented? Was there a problem with the customer interface or customer service? Note: Standards, policies, and administrative controls provide guidance on how an activity should be ac- complished, whereas procedures provide a detailed, step-by-step method for performing a specific task. For example, there are SPACs that describe the policies governing scheduling of workers. There is also a proce- dure that provides a detailed, step-by-step process for performing the task, including the forms to complete and data to enter in the computer system. Provide written documentation of SPACs Ensure that all levels of affected employees are aware of SPAC changes Track and document the final resolution for all corrective action recommendations Inspect materials for damage upon arrival at the facility Ensure that acceptance requirements are documented and match the design requirements  Review and approve field changes Periodically solicit feedback from customers A mechanic installing a cable tray drilled into a live wire within a wall because the facility drawings he was using were not up-to-date. A management system for control of electrical drawings may have prevented this occurrence by ensuring that the mechanic had up-to-date documentation. A management policy/procedure would also be required to ensure that such drawings are obtained/reviewed as part of the work permit system for penetrations of any wall. The management of change policy requires safety reviews of all process changes, but during an overnight emergency, a failed gate valve was replaced with a ball valve. The hazards of the change were not reviewed, and the valve subsequently ruptured when peroxide trapped in the ball decomposed. ADMINISTRATIVE/MANAGEMENT SYSTEMS ApPENDIX A  Root Cause Map Nope Descriptions Rd Administrative/ Management Systems Standards, aCe] LTA Not Strict Enough Confusing, Contradictory, or Incomplete Technical Error Responsibility for Item/Activity Not Adequately Defined Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA Employee Screening/Hiring LTA Standards, Policies, or Administrative Controls [SPACs] Not Used Communication of SPACs LTA Recently Changed Enforcement LTA Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Not Yet Implemented Risk Acceptance Criteria LTA Review Procedure LTA Problem Identification/ Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 57,
    "text_chunk": "Was the error caused by the lack or inadequacy of SPACs? Were the SPACs inaccurate, confusing, incom- plete, unclear, ambiguous, not strict enough, or otherwise inadequate? Were the wrong actions rewarded? Provide written documentation of SPACs  When errors are found, modify SPACs accordingly Ensure that policies regarding production, material control, procurement, security, etc., do not contra- dict safety policies  Ensure that the rewards and incentives are consistent with facility objectives An operator was unable to read at the level needed to understand facility procedures because employee screening standards were not high enough. As a result, he made a serious mistake in operating a key piece of equipment. The surveillance testing for the fire protection system had not been conducted for the past 2 years. The maintenance and operations departments both thought the other group was responsible for the test."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 58,
    "text_chunk": "Did a SPAC exist to control the particular type of work or situation involved in the incident? Was the work or situation significant or involved enough to warrant some type of SPAC to ensure adequate job quality and work control? Standards, Policies, or Administrative Controls [SPACs] LTA Compile a list of SPACs mandated by regulatory requirements (OSHA, EPA, etc.) and compare it to a current list of existing SPACs. Develop any missing SPACs  Provide written documentation of SPACs  Define, document, and communicate missing SPACs Not Strict Enough Example A maintenance worker was exposed to a pressurized release of a process material. The line from which the material was released had not been depres- surized and cleared before maintenance work began. The plant did not have a safe work practice/permit for opening process equipment (i.e., line break- ing)."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 59,
    "text_chunk": "Were the existing SPACs strict enough to provide adequate job quality or work control? Did vagueness allow violation of the intent, if not the letter, of the SPACs? Improve the level of detail of SPACs  Improve the description of accountabilities in SPACs (for resolving ambiguities) A safety limit was violated during operation of a process because an alarm indicating a high temperature was bypassed. The first-line supervisor thought the alarm was false and bypassed it. The SPACs were not strict enough, because they allowed the supervisor to bypass an alarm without getting any review or approvals from management and technical support. Operators were supposed to check the operation of pumps by taking vibration readings and checking temperatures. Instead, the operators just performed a visual check of the pumps. The SPACs did not specify how the operators were to check the pumps, and the SPACs did not require supervisors to periodically check on how the operators were performing their tasks."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 60,
    "text_chunk": "Were the SPACs confusing, hard to understand or interpret, or ambiguous? Were the SPACs incomplete or not specific enough? Did contradictory re- quirements exist? Were some requirements violated or disregarded in order to follow others? Was a SPAC not followed because no practical way of imple- menting the SPAC existed? Would implementation have hindered produc- tion?  Solicit comments and recommendations from operations/maintenance personnel regarding ambiguous or unclear language in the SPACs. Resolve comments  Ensure that policies regarding production, material control, procure- ment, security, etc., never contradict a safety policy  Communicate to operators that safety should be given top priority  Ensure that SPACs reflect managements decision to make safety top priority  SPACs that require specific authorization signatures should state alter- nate sources of authorization in the event the primary authorizers are not available Provide the necessary tools/equipment features to allow/encourage personnel to follow the SPACs A key piece of equipment in a process safety system failed. The policy stated that the required maintenance and inspections were to be performed annu- ally. Because of the difficulty of scheduling the work with production and the amount of work involved, the maintenance/inspection cycle had gradually slipped to 18 months. The policy did not state a maximum period of 12 months. A plant policy indicated that all fatigue-related failures be reported to the Equipment Reliability group. However, the maintenance organization had no guidance on what sort of failures were fatigue-related. In addition, a recent reorganization resulted in the elimination of the Equipment Reliability group, and their previous functions were split among four other groups. A release of a flammable liquid was larger than expected, overflowing the tanks dike. Administrative controls on the maximum intended inventories for the tanks in the dike were violated because of an anticipated shortage of the material from the supplier. Production decided to stock up on the material to prevent production outages."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 61,
    "text_chunk": "Did technical errors or incorrect facts exist in the SPACs? Did the SPACs fail to consider all possible scenarios or conditions? Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA  Include SPACs in the scope/charter of hazard review teams  When errors are found, modify SPACs accordingly A fire occurred when hot work near a process unit ignited vapors leaking from a nearby flange. The hot work policy for the plant erroneously indicated that a hot work permit was not necessary because the work was not specifically on equipment associated with hazardous materials. Not Strict Enough Confusing, Contradictory, or Incomplete Drawings were not updated following modifications. The SPAC controlling the design process was incorrect. Drawings were not sent to the correct individual in the drawing control department."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 62,
    "text_chunk": "Did the SPACs define the organization or group responsible for the item? Did confusion exist over who was responsible for the activity? Did an activity exist for which no one took responsibility? Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA  Assign responsibility for items/activities by including specific job titles in SPACs  Include accountability in job performance criteria (for job performance appraisals) wise Example A technical limit for the length of time allowed between air flow checks on a stack exhaust system was violated. The operations department considered the checks to be maintenance items. The maintenance department considered the checks to be an operations item. Responsibility for the checks was not defined."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 63,
    "text_chunk": "Was the work scheduling system adequate? Was the work properly planned? Was the work schedule used for implementing work? Was the work scheduled based on safety and reliability impact? Note: This node addresses the scheduling of work activities only, not the scheduling of personnel to accomplish the work. Problems with scheduling of personnel are addressed under node 186, Scheduling LTA (Immediate Super- vision, Preparation).  Update the tracking system daily, weekly, or monthly, as appropriate, by adding new action items and/or documenting the current status of all action items Conduct periodic, unannounced audits to verify that those action items documented as complete are actually complete  Limit access to the tracking/scheduling system to authorized personnel (e.g., use a password for an electronic system, lock system documenta- tion in a filing cabinet and distribute keys only to authorized personnel)  Prioritize action items and assign realistic dates for completion Develop and use indicators to help detect problems in ongoing use of management systems (e.g., how long does it take to respond to a request for change to a standard operating procedure?) A tank overflowed during filling because the automatic shutoff valve failed to close. An earlier inspection found that the level switch for the valve was defective, but the equipment deficiency had not been resolved. A scheduling system was developed by the maintenance planner; however, because there were too many panic repairs, the schedule was never followed. No one actually used the scheduling system to determine the priorities of the work that was performed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 64,
    "text_chunk": "Were workers rewarded for improper performance? Were incentives consis- tent with the goals of the company and facility? Did the reward system en- courage workers to take short cuts or waste resources?  Develop rewards that are consistent with company goals and objectives  Ensure that metrics and other measurements for performance are consistent with facility goals and objectives Performance of customer service representatives was measured by the num- ber of calls they handled each day. As a result, they tried to diagnose the problem as quickly as possible and provide a recommended solution. Be- cause the representatives were trying to diagnose the problem quickly, they often misdiagnosed the problem. About 40% of the phone calls were repeat calls from customers whose problems were misdiagnosed the first time. One of the metrics for the maintenance organization was the percentage of utilization for a certain lathe. This was measured by the percentage of time the lathe was operating. As a result, the operators turned on the lathe in the morning when they came in and let it run until they went home. They never used the lathe for work because it would decrease the amount of time the machine ran."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 65,
    "text_chunk": "Did an effective employee screening program exist? Did it correctly identify requirements for particular jobs? Did it screen employees against those requirements? Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA Typical Recommendations  Assess critical personal capability requirements for each job position Communicate all required job tasks to potential employees before extending employment opportunities  Ask job interviewees if they can perform job-related tasks Consider requiring the passing of a physical exam/drug-screen test as a Not Strict Enough contingency of employment  Have prospective employees perform a test that simulates the actual work as closely as possible to determine if they can perform the work Confusing, Contradictory, or Incomplete Technical Error Responsibility for |tem/Activity Not Adequately Defined An operator made a mistake operating a process on a color-coded distributed control system because he was color blind. Although a screening program existed for the job, it did not specify the ability to differentiate colors as a requirement. A maintenance technician made an error in repairing a mill. The technician could not read the procedure that he was supposed to use. Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA eC Screening/Hiring iar ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS ApPENDIX A  Root Cause Map Nope Descriptions RXsd Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA Not Strict Enough Confusing, Contradictory, or Incomplete Technical Error Responsibility for Item/Activity Not Adequately Defined Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA Employee Screening/Hiring LTA Ses oa Cy ea Cia very] eaters Communication of SPACs LTA Recently Changed Enforcement LTA Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Implemented Risk Acceptance Criteria LTA Procedure LTA Not Yet Review Problem Identification Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA. Corrective Actions Not Yet Implemented Procurement Control Purchasing Specifications LTA Control of Changes to Procurement Specifications LTA Material Acceptance Requirements LTA Material Inspections LTA Contractor Selection LTA Document and Configuration Control Change Not Identified Verification of Design/Field Changes LTA (No PSSR) Documentation Content LTA or Not Kept Up-to- Date Control of Official Documents LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 67,
    "text_chunk": "Were SPACs or directives not used, adhered to, or followed? Was communication or enforcement of SPACs inadequate? Were the SPACs recently revised or difficult to implement? Did the SPACs provide for adequate accountability? Note: SPACs provide guidance on how an activity should be accomplished, whereas procedures provide a detailed, step-by-step method for performing a specific task. For example, there are SPACs that describe the policies governing scheduling of workers. There is also a procedure that provides a detailed, step-by-step process for performing the task, including the forms to complete and data to enter in the computer system.  Ensure that all levels of affected employees are aware of SPACs changes * Take appropriate actions concerning those employees who do not use the SPACs  Apply lessons learned from one unit to other units A mechanic bypassed an important step in calibrating a key safety instrument because he did not take a printout of the procedure with him, as required. This was found to be an accepted practice in the facility. A requirement was in place to have the operators check instruments in the field once per shift. The operators never performed the checks. Supervision was aware of the situation and never enforced the requirement. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS ApPENDIX A  Root Cause Map Nope Descriptions Administrative! Management Systems Typical Issue Were standards, directives, or policies not communicated from management down through the organization? Standards, Policies, or Include SPACs content in initial and refresher formal training; determine employees understanding Periodically stress the importance of using SPACs during shift change meetings, safety meetings, etc.  Ensure that SPACs documentation is readily available to all affected employees at all times for reference purposes Administrative Controls [SPACs] Not Used et TT er Lacon) OE ea Recently Changed Enforcement LTA Example During an extended facility outage, routine surveillances of process alarm panels were not performed. As a result, a chemical leak went undetected for 2 days. Facility management had not communicated to first-line supervisors that normal surveillance procedures remained in effect during the outage."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 69,
    "text_chunk": "Had standards or directives been recently changed? Did information concern- ing changes fail to reach all levels of the organization? Had some confusion been created by the changes?  Ensure that all levels of affected employees are aware of SPACs changes  Verify that employees fully understand recent changes before expecting them to implement the changes  Ensure that there is a process for communicating SPACs changes to the individuals who need to know about the changes A new policy on calibration of flow indicators was provided to all of the maintenance department supervisors, but the mechanics were not told of the change. As a result, the policy was not implemented, as required. A new policy was put in place to require personnel to enter the time charged against each work order into a computer system. No one was told of the requirement or taught how to enter the information in the computer."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 70,
    "text_chunk": "In the past, has enforcement of the SPAC been lax? Have failures to follow the SPAC in the past gone uncorrected or unpunished? Has noncompliance been accepted by management and supervision? Standards, Policies, or Note: Coding under Rewards/Incentives LTA (SPACs/LTA), or Improper Performance Not Corrected (Immediate Supervision, Supervision During Work) may be appropriate. Administrative Controls [SPACs] Not Used Communication of SPACs LTA  Management should set an example by always following the letter of the Recently SPACs Changed Employees who do not use the SPACs should be corrected and/or punished Discipline needs to be fair, impartial, pre-stated, sure, and swift  Enforcement needs to be consistent Pers ba pa . A mechanic made a mistake installing a piece of equipment. He did not refer to a procedure when performing the test. Although policy is to always refer to the procedure, the policy had not been enforced. Mechanics often did not take procedures to the work site, and their supervisors were aware of this. Operators were supposed to log local tank levels every 2 hours. However, they would typically take the readings only at the beginning of the shift. They used these readings to fill in the readings for the remainder of the shift. No one ever took issue with this practice until after an accident occurred."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 72,
    "text_chunk": "Was the error caused by an inadequate hazard review of the system? Was a risk assessment of the system performed? Have the safety and reliability hazards been identified?  Ensure that all newly installed and/or modified equipment is included in a hazard review prior to startup Track and document the final resolution for all recommendations Ensure that personnel, equipment, and environmental losses are all addressed in the review A wastewater tank was overpressurized and failed. During the tie-in of a new line, the review team recom- mended the installation of a larger overflow line to handle the largest possible flow into the tank. The results of the review were not incorporated into the installation package. The new line was tied into the tank with- out a new overflow line installed. A scenario for rapid overpressurization of an atmospheric decanter system was not considered prior to startup of a process because the hazard review did not address procedural deviations during an allowable startup mode."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 73,
    "text_chunk": "Was the safety and hazard review complete? Did it consider all modes of operation/maintenance, and were other required hazard review issues consid- ered? Was the review done according to all applicable orders, regulations, and guides? Was a safety/hazard/risk review performed? Administrative/ Management Systems Safety/Hazard/ Risk Review  Provide a safety/hazard/risk review procedure that complies with all applicable orders, regulations, and guides  Ensure that the hazard review procedure is readily available to person- nel who will conduct the review  Periodically audit hazard review meetings and reports  Establish minimum training criteria for hazard review leaders Ensure that all newly installed and/or modified equipment is included in a hazard review prior to startup  Ensure that hazard review documentation is readily available to docu- ment the content of the review and to confirm that a review was per- formed OTe Ele le ar Recommendations Not Yet Implemented Risk Acceptance Criteria LTA Review Procedure LTA An explosion occurred in a waste tank because incompatible materials were mixed. The process hazards review had been performed, but it failed to consider all the possible sources of material that could be added to the tank. An explosion occurred in a waste tank after a new stream had been tied into the tank. No safety review had been performed prior to tying in the stream to determine if incompatible materials would be in the waste tank after the tie in. No analysis had been performed to determine the operational risks associated with a new conveyor system. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS ApPENDIX A  Root Cause Map Nope Descriptions Administrative/ Management Systems Typical Issue Have the recommendations from the safety/hazard/risk review been imple- mented?  Ensure that all hazard review recommendations are documented and reviewed by management personnel Management should address all hazard review recommendations and document the manner in which the recommendation will be resolved (i.e., assign a responsible party for completion or reject the recommen- dation with documented reason for doing so)  Communicate hazard review recommendations to all affected parties Document the final resolution or implementation of each recommenda- tion  Publish periodic reports of resolution status for management  Ensure that implementation of the recommendations is assigned to a specific group or individual Safety/Hazard/ Risk Review Review LTA or Not Performed (een Cac Tsar Risk Acceptance Criteria LTA Review Procedure LTA A release of hazardous material through a rupture disk was discharged to the diked area of the process. The hazard review had recommended installing a catch tank, with a rain hood/cover, to receive any discharged material. The catch tank had not been installed because of scheduling conflicts with other construction in the area. The released material reacted violently with rain water in the diked area, producing a large quantity of toxic gas. As a result of a facility risk/reliability analysis, recommendations were made to have a final inspection performed of unusual and partial shipments to ensure that they are correct. This recommendation had not been implemented yet."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 75,
    "text_chunk": "Were the risk acceptance criteria used during the safety/hazard/risk review set inappropriately? Were risks deemed acceptable that should have been re- duced? Administrative/ Management Systems Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Not Yet Implemented  Ensure that a diverse team (able to reasonably assess risk) is involved in the hazard review Develop more objective criteria for judging risk levels (e.g., a simplified risk scoring scheme or listing required safeguards for specific situations)  Provide guidance to team members to help ensure that the reviews are conducted properly An explosion occurred when the incorrect material was fed into the reactor. The supplier had mislabeled the material. The hazard review had identified this as a risk factor but concluded that the risks associated with not analyzing the incoming materials were acceptable. tee rrr caer Criteria LTA Review Procedure LTA Company criteria for multiple layers of safeguards allowed a large credit for relief valves. As a result, insufficient attention was given to reducing the frequency of relief valve actuations."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 76,
    "text_chunk": "Was the safety/hazard/risk review procedure less than adequate? Does it provide adequate guidance for the scope of the review? Are the resources needed to perform the review available? Are personnel trained in the use of the procedure?  Ensure that the hazard review technique is appropriate for the complex- ity of the process  Ensure that all newly installed and/or modified equipment is included in a hazard review prior to startup  Ensure that hazard reviews comply with all applicable orders, regula- tions, and guides (e.g., some provide specific checklists for the safety/ hazard review)  Ensure that the review procedure addresses scope of analyses and training of hazard analysis team leaders A complex shutdown system failed to mitigate a process upset, resulting ina release of a hazardous material. The review procedure for the plant specified that a HAZOP be performed for all new/modified systems; however, the HAZOP procedure was not well-suited for analyzing this type of system (the FMEA technique would have been a better choice of technique). A major spill violating an environmental permit occurred at a process that had recently undergone a hazard review. This type of spill, which had no safety consequences, was not addressed in the study because the review procedure did not require evaluation of environmental hazards. A risk assessment was recently performed on a packaging operation. The risk assessment did not address supply problems because the review procedure did not require that issue to be considered. Later, a fire at a key supplier's facility led to a 4-week shutdown."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 78,
    "text_chunk": "Was an event caused by failure to provide corrective action for known deficiencies or failure to implement recommended corrective actions before known deficiencies recur? Had the problem occurred before and never been reported? Did an audit fail to discover the problem? Did the corrective actions implemented fail to correct the problem? Note: If the problem/deficiency could/should have been identified, or was identified in a safety/hazard/risk review, then code the event in that portion of the Map and not here.  Track implementation of corrective actions to ensure timely completion Consider implementing the same corrective actions for similar situations at this and other facilities Measure the effectiveness of corrective actions Periodically compare the results of audits with events that occur in the facility to ensure that audits are effective in identifying problems A tank overflowed because an operator ignored an auditory alarm in the control system. The alarm, which sounded spuriously about every 15 minutes, had been broken for more than 6 months. The problem had been reported to the maintenance organization but had not been repaired. A tank had overflowed when the operator started the wrong pump. None of the pump control switches were labeled. A corrective action from this event was to install labels on the pump switches. Prior to installation of the labels, another pump was damaged when the operator started the wrong pump. The switches for these pumps were not labeled either."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 79,
    "text_chunk": "Are personnel reporting events that have significant impacts on health, safety, or reliability? Are personnel aware of the types of events that should be reported? Do they know how to report the events? Are employees punished for reporting problems? Note: Coding under Rewards/Incentives LTA may also be appropriate. Develop event-reporting guidelines  Provide training to personnel on the types of events that should be reported. Make these examples as process specific as possible  Ensure that the event-reporting process is as simple as possible An engineer noted oil dripping from a pump seal. The process for reporting and documenting the problem required a lot of forms to be filled out. The engineer did not want to take the time to complete the forms. As a result, he did not report the problem. An operator reported a problem with the drying oven he was using. The temperature control system had malfunctioned and a batch of product had been damaged. Company policy required individuals who reported problems to help personnel correct the situation. As a result, the operator was required to work overtime to assist with the repairs and he missed the college basket- ball championship game on television. The next time the operator discovered a problem near the end of his shift, he did not report it because he did not want to stay over past his shift."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 80,
    "text_chunk": "Was the problem misdiagnosed? Were knowledgeable personnel involved in the problem analysis? Was proper emphasis placed on problem diagnosis? Develop generic methods for problem analysis such as the 5 Whys technique, fault tree analysis, and/or causal factor charting  Train all personnel to some level of troubleshooting. Provide appropri- ate experts to assist analysis teams Have the results of the analysis reviewed by someone outside the organization An accident occurred in a reactor vessel. The incident investigation team thought the explosion was caused by a lack of grounding on the tank. After a second event, it was determined that the wrong materials were being fed into the tank and that this had triggered the explosion. A root cause analysis team determined that spurious shutdowns of a mixing line were caused by operator errors. Subsequent shutdowns indicated that electronic spikes were causing pressure spikes that caused a safety system to actuate and shut down the line."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 81,
    "text_chunk": "Do audits find problems before they cause safety, reliability, or quality prob- lems? Are audits performed at regular intervals? Typical Recommendations  Ensure that periodic audits of systems important to safety, reliability, and quality are developed  Ensure that audits are periodically implemented An audit had been developed to ensure that personal protective equipment (hard hats, safety goggles, etc.) was being worn by plant personnel. However, the audit was only conducted once. No audits had been developed to determine if quality assurance inspections of final products were being implemented effectively."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 82,
    "text_chunk": "Were implemented corrective actions unsuccessful in preventing recurrence? Should other corrective actions have been identified? Were corrective actions focused on correcting the root causes of the problem?  Involve a multidisciplinary team in identifying corrective actions to ensure that the problem has been fully analyzed  Refer design/development of corrective actions to specialists when teams have difficulty identifying practical solutions Develop measures to determine the effectiveness of corrective actions  Trend event causes and root causes to determine if corrective actions are effective in preventing recurrence A problem with operators bypassing alarms had been identified. The correc- tive action was to administratively control alarm bypasses. After a couple of years, the administrative control requirements were being ignored. Physical changes to equipment may have been more successful in preventing bypass- ing of alarms. The procedure development process was modified to ensure that precautions and warnings were placed in procedures where appropriate. However, an audit of procedures performed a year later identified hundreds of procedures that did not have the proper precautions and warnings. An operator was fired for poor performance. The operator had produced a number of bad batches. An experienced operator was moved into this posi- tion and also produced a number of bad batches. When the system was analyzed, it was determined that the control system was poorly designed and could not be easily controlled. A gear tooth failure destroyed the gear train of a printing press. Only those gears with visibly damaged teeth were replaced. The press failed again about 6 months later when another gear tooth, overstressed but not visibly de- formed by the first incident, failed. ADMINISTRATIVE/MANAGEMENT SYSTEMS Ee Root Cause ANAtysis HANDBOOK Administrative/ Management Systems Problem Identification/ Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA rt TaD Pv ecg eect Typical Issue Was a recommended corrective action for a known deficiency not imple- mented (because of delays in funding, delays in project design, normal length of implementation cycle, tracking deficiencies, etc.) before recurrence of the deficiency? Are corrective actions assigned to specific groups or individuals for implementation? Does management monitor the implementation of corrective actions?  Ifa system is deficient and requires corrective actions that cannot be implemented immediately, interim measures should be taken (imple- menting a temporary operating procedure, process parameter changes, shutting equipment down, etc.) Corrective actions affecting safety should not be delayed because of lack of funding, delays in project design, or normal length of the imple- mentation cycle  The cost of implementing corrective actions with significant impacts on reliability and quality should be balanced against the anticipated savings from implementation  Ensure that management periodically reviews the status of corrective actions  Reward personnel for completing corrective actions A tank collapsed under vacuum. An earlier hazard analysis recommended vacuum breakers for this type of tank, but these devices had not yet been installed. A root cause analysis of a quality problem recommended that special orders be packaged in different colored barrels to highlight the need for special handling. Since this recommendation was made, 16 more instances of mis- takes with special orders occurred. The recommendation had never been implemented. An incident investigation recommended that small drain holes be drilled in the discharge line of all fire monitors to prevent accumulation of water that could freeze and plug the monitor. This recommendation had not been imple- mented before another fire occurred, and two of the three monitors failed because they were plugged with ice. An audit recommended shape coding of certain controls on the control panel to avoid selection errors. This recommendation had not been implemented when another batch of product was ruined as a result of an operator switch selection error. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS AppENDIX A  Root Cause Map Nope Descriptions Re Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA Not Strict Enough Confusing, Contradictory, or Incomplete Technical Error Responsibility for Item/Activity Not Adequately Defined Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA Employee Screening/Hiring LTA Standards, Policies, or Administrative Controls [SPACs] Not Used Communication of SPACs LTA Recently Changed Enforcement LTA Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Implemented Risk Acceptance Criteria LTA Procedure LTA Not Yet Review Problem Identification Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 85,
    "text_chunk": "Was the problem caused by inadequate material handling, storage, packaging, or shipping? Was the shelf life for the material exceeded? Was an unauthorized material substitution made? Were spare parts inadequately stored? Was the problem caused by inadequate handling, storage, packaging, or shipping of finished prod- ucts?  Ensure that materials are stored in a proper environment  Inspect materials for damage upon arrival at the facility  Provide proper packaging of finished products to avoid damage during shipping  Provide proper environmental conditions for raw materials and finished products to ensure quality As a result of improper labeling, a grease was placed into inventory on the wrong shelf in the supply room. Subsequently, a pump failed when this grease was used instead of the one specified for that pump. Because of a snow storm, product could not be shipped on schedule. The warehouse was full of finished product so it was temporarily stored in narrow aisles in the process area. Some of the product was damaged when an operator ran into the skids with a forklift."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 86,
    "text_chunk": "Was material/equipment/product damaged during handling? Were items mixed up during handling? Was the equipment used for moving materials appropriate for the items?  Consider the size, weight, and hazards associated with transporting materials, and choose a mode of transport that is appropriate Consider tagging equipment before transporting it to the field to ensure that similar items are not inadvertently switched The wrong pump was installed in a line. The mechanics were installing several pumps and had them all on a cart. They were mixed up and in- stalled in the wrong locations. Machined plates were placed in a cart for transport from one station to the next. Recently, the cart had been repaired with screws that were too long. As a result, some of the plates were scratched as they were placed on or removed from the cart. A conveyor that was used to move brass fixtures to a packaging location moved continuously. This caused the fixtures to rotate for long periods of time while they were bunched up near the end of the conveyor. As a result, the finish on some of the fixtures was marred."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 87,
    "text_chunk": "Systems Was material stored improperly? Was it damaged in storage? Did it have weather damage? Was it stored in an environment (heat, cold, acid fumes, etc.) that damaged it? Was product properly stored? Were material/equip- Product! ment/parts issued after their shelf life was exceeded? Did materials continue Material to be used after the shelf life was exceeded? Were spare parts and equipment stored properly? Was adequate preventive maintenance (cleaning, lubrica- tions, etc.) performed on spares? Handling LTA  Ensure that materials that require a controlled environment for storage are not exposed to the weather Before stacking materials in a warehouse, ensure that the contents and the packaging are compatible with this storage configuration and will not be damaged Promptly correct problems affecting storage in controlled environments (failures of heating/cooling systems, humidity control systems, etc.) Unauthorized  Ensure that the proper environment is provided for finished product substitution * For materials with a shelf life, develop a system to document the materials shelf life, date of manufacture, and date of distribution Product  Assign stores employees the responsibility of ensuring that the shelf life Acceptance has not been exceeded  Ensure that spare parts are not exposed to adverse weather conditions  Promptly correct problems in equipment storage conditions or environ- mental controls in warehouses Storage aN Oo. Packaging/ Shipping LTA . Product Inspections L a An absorption column installed to remove contaminants from solvent did not operate as designed. Investiga- tion revealed that the absorbent material used to pack the column had been stored outside and uncovered. The damaged material reduced the efficiency of the column. The air conditioning system in the finished product storage area at a glue factory was inoperable for about a week during the summer. The warehouse reached temperatures of over 120 F Some of the glues were damaged from the excessive heat. Rubber tubing used in the cooling system of portable generators cracked and failed. The shelf life of the rubber tubing installed had been exceeded and the tubing had become brittle. A pump failed shortly after installation, which was much earlier than anticipated given the life expectancy of the pump. Investigation revealed that the pump had been stored in spare parts for a long time. During the storage, no preventive maintenance, such as cleaning and lubrication, had been performed as specified in the manufacturers instructions for storage."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 88,
    "text_chunk": "Systems Was material packaged properly? Was it damaged because of improper packaging? Was equipment exposed to adverse conditions because the packaging had been damaged? Was the material transported properly? Was it Product damaged during shipping? Material Control Handling  Inspect materials for damage upon initial arrival at the facility LTA  Ensure that packaging specifications are documented, communicated, and clearly understood by the vendor Provide directions for unpacking items so they are not damaged by the customer Ensure that proper packaging methods are used for the final product Storage LTA oe Packaging/ Baar Examples ary . . . . An electronic system incurred water damage because it was not packaged in waterproof packaging as specified in the packaging requirements. Unauthorized sapattaon An electronic device used for chemical analysis provided incorrect analysis results. As a result, 10,000 gallons of product were later found to be unaccept- able. Investigation revealed that the electronic device had been dropped off of Product . : : Acceptance a forklift. Because there was no obvious physical damage, the manufacturer riteria shipped the device. Product A water-based coating material was peeling off within several days of being Inspections applied. This shipment of the coating material had frozen during transport by truck. Freezing changed the adhesiveness of the coating material. Motorcycle windshields were packaged in cardboard boxes that were held shut with large metal staples. If the staples were not completely pulled out of the box, they would scratch the plastic windshield when it was removed from the package, making the windshield unusable."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 89,
    "text_chunk": "Were incorrect materials substituted? Were material or parts substituted without authorization? Did the requirements specify no substitution? Did substitution of different materials adversely affect the quality of the final product?  Implement a management of change program  Train employees to use the management of change system  Ensure that field/warehouse personnel understand the management of change systems importance to them  Assess the impact of material substitutions on the quality of the product produced  Ensure that materials are properly labeled to prevent inadvertent substi- tution  Attempt to design the process so that only the correct item will fit A valve failed, causing a spill to the environment. The valve was not the one specified for this service. Because the specified one was not available, a substitute had been installed without the proper review and authorization. A drawing indicated that 2 bolts would be needed to install a bracket. When the mechanic actually performed the installation, 2.5 bolts were needed. Instead of going back to the warehouse to get the right size bolts, the me- chanic used the 2 bolts with the nuts only partially threaded and no lock washer. Later, the bracket fell off when the nuts vibrated off the bolts."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 90,
    "text_chunk": "Could the acceptance criteria for manufactured parts and finished products be understood and implemented? Were the acceptance criteria clear and unam- biguous? Note: This node only applies to product (things made within your facility) acceptance criteria. Acceptance criteria for purchased materials (items re- ceived from outside your facility) are specified as part of the procurement process and are addressed under Material Acceptance Requirements LTA (Procurement Control).  Develop acceptance criteria for manufactured parts, materials, and finished products  Ensure that product acceptance tests can be reasonably implemented Example Inspection of toilet paper rolls included checks of the dimensions of the roll, the adequacy of the paper rolling process, and the fragrance added to the roll. Acceptance criteria were specified for the roll dimensions and adequacy of the rolling process. No acceptance criteria existed for the adequacy of the fra- grance level. As a result, some batches were shipped without the required fragrance."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 91,
    "text_chunk": "Management Systems Was inspection of materials performed in accordance with the acceptance requirements? Did a lack of inspection lead to safety, reliability, or quality problems? Were manufactured parts, materials, and final products inspected Product! prior to shipment? Can the inspection requirements be reasonably imple- Material mented? Do intellectual products (i.e., reports, analyses, data) meet require- ments? Note: This node only applies to materials and work products produced within Handlins LTA your facility. Inspections of all materials and work products received from outside the facility are addressed as part of the procurement process under Material Inspections LTA (Procurement Control). Storage LTA ve Packagingy  Ensure that material/product inspections are performed in accordance Shipping + 5 La with requirements  Provide clear inspection specifications and methods for product testing  Provide personnel with the capability to implement the inspection Unauthorized Material requirements Substitution Examples Product : : fg: : Acceptance Acceptance criteria specified that a moisture test should be performed on a Criteria LTA sample of each shipment of powder. The warehouse was not told who was supposed to do the test. As a result, the material was shipped without the test bans being performed. ie ts eae LTA Product inspection requirements specified that 10% of all items be inspected before shipment. When one of the quality assurance inspectors was gone (e.g., sick, in training), only 5% could be inspected without holding up ship- ments. As a result, a number of bad lots of material were shipped. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS AppENDIX A  Root Cause Map Nope Descriptions Rs Administrative/ Management Systems Standards, Policies, or Administrative Controls [SPACs] LTA Not Strict Enough Confusing, Contradictory, or Incomplete Technical Error Responsibility for Item/Activity Not Adequately Defined Planning, Scheduling, or Tracking of Work Activities LTA Rewards/ Incentives LTA Employee Screening/Hiring LTA Standards, Policies, or Administrative Controls [SPACs] Not Used Communication of SPACs LTA Recently Changed Enforcement LTA Safety/Hazard/ Risk Review Review LTA or Not Performed Recommendations Implemented Risk Acceptance Criteria LTA Procedure LTA Not Yet Review Problem Identification Control Problem Reporting LTA Problem Analysis LTA Corrective Action LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 93,
    "text_chunk": "Was the error the result of inadequate control of changes to procurement specifications or purchase orders? Did a fabricated item fail to meet requirements or was an incorrect item received? Did product acceptance requirements fail to match design requirements or were they otherwise unacceptable? Were proper specifica- tions and evaluations used to select contractors?  Procurement specifications should not be changed without review and approval by knowledgeable personnel  Ensure that acceptance requirements are documented and match the design requirements  Ensure that the contractor selection process considers the impact on overall cost, reliability, and quality Example A large tank was fabricated using an incorrect grade of stainless steel because the buyer made an unautho- rized change to the purchase order, and the personnel who signed off on the order did not detect the change. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS AppENDIX A  Root Cause Map Nope Descriptions Administrative/ Management Systems Procurement Control eer Seer ayy Control of Changes to Procurement Specifications LTA Material Acceptance Requirements LTA Material Inspections LTA Contractor Selection LTA Typical Issue Did the purchase specifications include (1) a schedule for delivery of the materials, (2) material packaging and shipping requirements, (3) safety requirements, (4) liability clauses, and (5) payment schedules? Note: This node applies to HOW items are obtained, not WHAT is obtained. See Material Acceptance Requirements LTA for problems related to specifica- tion of what was purchased. Typical Recommendation * Develop purchase specifications with input from the technical contacts, procurement specialists, attorneys, and others in your company to ensure that all contractual requirements are addressed Example A contract to purchase logs from a supplier did not include late delivery penalties. As a result, the supplier was routinely a week or two behind sched- ule."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 95,
    "text_chunk": "Were changes made to purchase orders or procurement specifications without the proper reviews and approvals? Did the changes result in purchase of the wrong materials? Did changes in contract language cause safety, reliability, quality, or legal problems? Include procurement control procedures in the management of change program  Provide receipt inspection that compares the materials supplied against the original plant request A pump made from Hastelloy C was ordered for use in a hypochlorite liquid plant. Purchasing went out for bids on Hastelloy pumps (and did not specify Hastelloy C). A Hastelloy B pump was received, and failed after only 4 days of service because of chemical attack. During the purchasing process, the procurement specialist bought unformatted diskettes because they were cheaper. As a result, each disk had to be formatted by the user. This resulted in about 40 hours of wasted pro- duction time while the disks were formatted. A contract to hire subcontractors originally required the contractors to supply hazardous material handling training to their personnel at the contractors expense. This requirement was subsequently dropped. As a result, the com- pany had to pay for the training and pay the contractor for the time their personnel spent in the training. A batch of product was ruined because of improper mixing of the compo- nents. Purchasing had switched suppliers to reduce costs. The feed material was now purchased at twice the concentration as before. The management of change system did not identify it as a change because the same material was purchased from both suppliers."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 96,
    "text_chunk": "Were acceptance criteria for raw materials, spare parts, and process equip- ment adequate? Was it easy to determine if the material received was accept- able? Note: This node applies to problems related to WHAT was purchased. Prob- lems associated with the process of obtaining, paying for, and delivering the material is covered under Purchasing Specifications LTA. Typical Recommendation Develop acceptance criteria for raw materials, spare parts, and process equipment  Have the warehouse personnel assist in the development of the accep- tance criteria to ensure that they are clearly understood by those who will use them Acceptance criteria specified that the bolts should have a Rockwell-C hard- ness of 30. Warehouse personnel did not know what this meant or how to determine if the bolts met this specification. Acceptance criteria specified that the powder should not contain excessive moisture. Warehouse personnel did not know exactly what this meant. As a result, they accepted material that was unusable. Acceptance criteria had not been developed for rubber gaskets used in a process. The gaskets deteriorate rapidly if they are not individually sealed in plastic. Without any acceptance criteria, the warehouse accepted a shipment of gaskets that were not individually wrapped and sealed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 97,
    "text_chunk": "Was the inspection of materials performed in accordance with the acceptance requirements? Did a lack of inspection lead to safety, reliability, or quality problems? Were manufactured parts or materials inspected prior to accep- tance or use in your process? Can the inspection requirements be reasonably implemented? Do intellectual products (i.e., reports, analyses, data) meet requirements? Note: This node only applies to materials and work products produced outside your facility. Inspections of all materials and work products produced within your facility are addressed as part of the product material control process under Product Inspections LTA (Product/Material Control).  Ensure that material receipt inspections are performed in accordance with requirements  Provide clear inspection specifications and methods for material accep- tance.  Provide personnel with the capability to implement the inspection requirements Acceptance criteria specified that a moisture test should be performed on a sample of each shipment of powder received from a supplier. The warehouse was not told who was supposed to do the test. As a result, the material was accepted and used without the test being performed. The acceptance criteria for a raw material specified that a lengthy test be performed before the material would be transferred from the tanker to the supply tanks. Another, less rigorous, test was often substituted to save time. An outside contractor was employed to perform a safety analysis of a system in accordance with OSHA requirements. No one reviewed the contractors report prior to closing out the contract. The contractor failed to analyze all of the portions of the system that were in the scope of the contract. ener e ener eee eee ADMINISTRATIVE/MANAGEMENT SYSTEMS AppENDIX A  Root Cause Map Nope Descriptions Administrative/ Management Systems Procurement Control Purchasing Specifications LTA Control of Changes to Procurement Specifications LTA Material Acceptance Requirements LTA Material Inspections LTA Perc ta le Bo ra Typical Issue Does the contractor selection process address the following: (1) safety require- ments, (2) training, (3) liability, and (4) scheduling? Typical Recommendation  Develop purchase specifications for contract services with input from the technical contacts, procurement specialists, attorneys, and others in your company to ensure that all contractual requirements are addressed A contract to hire subcontractors did not specify who was responsible for paying for hazardous material handling training for the contract personnel. As a result, the company had to pay for the training and pay the contractor for time their personnel spent in the training. The contract for supplying maintenance personnel did not specify that equip- ment supplied and used by the contractor be subject to approval by the company. As a result, the contractor used ladders and other equipment that did not meet OSHA requirements."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 100,
    "text_chunk": "Were drawings or documentation not complete or up-to-date? Was control of design/field changes inad- equate? Was the error caused by improper control of as-built documents? Was an unofficial copy of a procedure/drawing used? Typical Recommendations  Train all employees to understand the difference between a change and a replacement-in-kind. * Field changes should be reviewed and approved * Periodically audit to verify that all official copies are updated A batch of product was ruined because of improper mixing of the components. Purchasing had switched suppliers to reduce costs. The feed material was now purchased at twice the concentration as before. The management of change system did not identify it as a change because the same material was purchased from both suppliers. An operator was using an out-of-date process drawing in the field because it contained all of his markups. The markups were required to correct errors on the drawing and to add additional information the drawing did not contain."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 101,
    "text_chunk": "Was the change to the system identified? Was the definition of change LTA? Did personnel understand the definition of change versus replacement-in- kind?  Ensure that authorization signatures are obtained from key personnel before design/field changes can be implemented  Train all employees to understand a change versus a replacement-in- kind  Train employees on how to initiate a request for change  Provide specific examples of what is and is not a change requiring review An SO, release occurred because a stiffer gasket was installed. The gasket installed could last longer in this chemical service, but would not seal properly using previous torque settings. The management of change system defined replacement-in-kind as use of similar or better materials. Because the maintenance department considered the new gasket material superior, a change review was not performed. A new supplier was selected to supply product barrels to the facility. Barrels from the new supplier were cheaper but only came in one color (black). This caused shipment problems because different colored barrels had been used previously to easily identify the barrel contents. Purchasing did not realize the importance of the color coding. A field modification to an instrument air line had to be made to route the line around a water line that was not on the drawings used by the designer. This reroute created a low point in the air line where contaminants collected. The field modification was not identified as a change that required a review."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 102,
    "text_chunk": "Were new equipment or installations verified to conform to specifications prior to startup? Were new or modified components functionally tested prior to startup? Typical Recommendations  Conduct a pre-startup safety review for new or modified facilities, and ensure that all requirements of the review have been met before highly hazardous chemicals are introduced into the process * Conduct an assessment of field changes and new installations to ensure proper operation of the equipment following startup A control valve failed to the wrong position upon loss of instrument air. A pre- startup safety review was not performed because the valve was installed as part of a replacement-in-kind. A new air compressor was installed. A pre-startup review of the installation was performed to ensure that it was installed correctly. However, no opera- tional tests of the compressor were performed. As a result, the compressor failed soon after startup because of an insufficient cooling water supply."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 103,
    "text_chunk": "Systems Were drawings and documents updated when changes were made? Did documents/drawings reflect the current status? Do documents contain all of the required information? Do documents used in the field have markups to Document and make them useful? Configuration Control Note: This node applies primarily to drawings and operator aids. Procedure content problems are addressed under Procedures. Problems associated with the content of SPACs are addressed under SPACs LTA. Change Not Identified Verification of Design/Field * Require authorization signatures for all design/field changes ono besR) * Include the task of updating drawings and procedures in the document change tracking system cg  Solicit input from document users on required changes. Content LTA or : : . . SN aa  Involve the document users in periodic reviews and updates of the documents * Consider conducting mandatory walkthroughs in the field following ontca construction to confirm that official documents accurately reflect actual Documents LTA . design Examples A settling tank was moved 4 feet from its original location to allow for proper forklift access to other equipment. This field change was not indicated in the final design documentation. As a result, a skid-mounted demineralizer installa- tion had to be field modified because the settling tank took up part of the floor to be used for installation of the demineralizer skid. Two system modifications were being implemented concurrently; however, the design engineers did not know this. The drawings did not indicate that changes were pending from these two modifications. As a result, changes implemented by the first modification were undone by implementation of the second modification. An acid spill occurred during opening of a line break. Lockouts had been made based on current drawings. The drawings were not up-to-date and did not show an acid stream that had been tied into the line 3 months earlier. The system that existed for controlling documents was not adequate. The organi- zation was 6 months behind on updating marked-up drawings and distribut- ing new copies to all official document holders."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 104,
    "text_chunk": "Did a system exist for controlling documents? Did the system provide meth- ods for keeping documents up-to-date? Were all necessary documents avail- able? Were all official copies of each document updated? Were all unofficial copies or outdated copies found or disposed of? Are procedures, standards, policies, and other official documents used in the field current? Note: This node applies to the distribution of documents. Problems related to the content of the document are addressed under Documentation Content LTA or Not Kept Up-to-Date.  Search and destroy unofficial copies of documents  Periodically conduct an audit to ensure that all official copies are up- dated Example Maintenance personnel often made printouts of procedures that they kept at their workstations. That way they did not need to get a new copy of the procedure each time. However, they did not check for updates each time before use."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 105,
    "text_chunk": "Are there problems associated with the customer interface? Are customer needs identified? Are customer needs addressed? Typical Recommendations * Develop a system to solicit feedback from customers  Develop a system to allow customers to easily contact your company  Ensure that customer requests are promptly addressed A customer required special product packaging to allow it to quickly load the product into its system. Some shipments were made using the special container while others were not. This requirement was not always passed on to the plant personnel. Customers ordered materials from a catalog. Not all items in the catalog were being manufactured. Customer service still accepted orders for these items because they were not told that they were no longer being made."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 107,
    "text_chunk": "Are customer requirements for products identified? Is there a mechanism in place to solicit customer requirements? Typical Recommendations  Provide incentives to personnel to solicit and clarify customer require- ments  Provide a means to handle special orders and requests A customer initially ordered 20,000 pounds of material A. Later, the customer changed the order to 30,000 pounds of material B. This change was never input into the order system. As a result, the wrong material was delivered to the customer. A printer used a standard blue color to produce pamphlets for a client. A customized blue color should have been used to match other advertising materials used by the client. The printer just assumed that a standard color (which is less expensive) was what the client wanted."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 108,
    "text_chunk": "Are customer needs passed on through the organization to those who need to know about them? Are there methods to produce products that meet unusual requirements? Typical Recommendations  Ensure that customer requirements are passed on to all those in the organization who need to know about them  Provide a means to flag special orders to make them easy to identify Example A customer required special product packaging to allow it to quickly load the product into its system. Some shipments were made using the special con- tainer while others were not. This requirement was not always passed on to the plant personnel."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 109,
    "text_chunk": "Management Systems Were there problems in addressing the customer requirements? Can all customer requirements be addressed? Were customer service personnel helpful? Were customer service personnel courteous? Customer Interface/ Services Typical Recommendations Provide a method to close the loop. Compare the product to the origi- nal customer requirements Develop a system to track special orders  When problems are encountered, follow up with the customer to clarify what went wrong. Ensure that follow-up actions are taken to prevent recurrence Customer Requirements Not Identified Customer Needs Not Addressed Ter eet a ar Example Special customer orders were taken by the customer service center and passed on to the plant. The plant placed a low priority on these items because they would interrupt normal production. As a result, most special orders were delivered several weeks after the promised delivery date."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 110,
    "text_chunk": "Was a procedure used to perform the job? Was the procedure incorrect or incomplete? Was a procedure developed for the job? Was a proce- dure required to perform the job? Note: Procedures provide detailed, step-by-step directions on how to accomplish a task. Guidance documents that provide general guidance and principles should be addressed under SPACs LTA or SPACs Not Used (Administrative/Management Systems).  Ensure that copies of procedures are available for worker use at all times  Ensure that procedures are in a standard, easy-to-read format  Perform a walkthrough of new and revised procedures  Use look-up tables instead of requiring calculations to be performed An operator failed to complete a critical step in an operation because the procedure he obtained from the procedure files was not the most recent revision. A new operator failed to complete a critical step because the procedure was not detailed enough; it was written as a guideline/reminder for experi- enced operators."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 111,
    "text_chunk": "Was a procedure used to perform the job? Was a copy of the procedure available to the worker? Did the procedure system require that the proce- dure be used as a task reference or was it just for training? Were personnel required to take copies of the procedures to the field? Should the use of the procedure be required even though it was not in the past? Was a procedure written for this task?  Ensure that copies of procedures are available for worker use at all times Develop procedures with sufficient detail for the least experienced, qualified worker  Supplement training and reference materi- als with easy-to-carry checklists that parallel a procedure An operator made a valving error. He performed the task without using the controlled procedure because he would have had to make a copy of the master. A mechanic incorrectly performed a repair job on a key pump without using the procedure. Me- chanics were not required to use the procedure in the field because it was for training purposes only. However, using the procedure in the field would probably have prevented the error made by the mechanic."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 112,
    "text_chunk": "Did a procedure exist for the job or task being performed? Was the procedure readily available? Was there a copy of the procedure in the designated file, shelf, or rack? Was there a master copy of the procedure available for reproduction? Procedures Ont Not Available or  Place copies of operations and maintenance procedures in the appropri- events! ety ate work areas so that the procedures are ALWAYS available for person- nel use * Maintain master copies of all procedures and control access to these Procedure Difficult to Use masters Examples Use Not Required . . but Should Be An operator made a valving error. He did not use the controlled procedure because it would have required him to make a copy of the master. Instead he used the procedure copy he had at his workstation. This procedure was out- No Procedure of-date. for Task An electrician was troubleshooting a large breaker. After determining what the problem was, she should have obtained a copy of the procedure for replace- ment of the charging springs. But that would have required her to return to the maintenance shop. So she replaced the spring based on memory. As a result, a plant startup was delayed when the breaker failed to close."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 113,
    "text_chunk": "Considering the training and experience of the user, was the procedure too difficult to understand or follow? Was sufficient information available to identify the appropriate procedure? Was the procedure designed for the less practiced user? Was procedure use inconvenient because of working condi- tions (e.g., tight quarters, weather, protective clothing)? Note: Dual coding under Misleading/Confusing (Procedures) may also be appropriate. Develop procedures such that the content provides the least experi- enced employee with adequate direction to successfully complete required tasks Choose a procedure format that is easy to read and follow Choose a procedure format that is appropriate to the level of complex- ity of the task If certain job tasks require an employee to be in an awkward position or to wear uncomfortable personal protective equipment, make procedure use as convenient as possible by posting applicable procedures at eye level in an easy-to-read format in these specific locations  If tasks require reference in the field to a procedure, ensure that employ- ees are provided with a concise yet complete (with no references to other procedures) procedure (or checklist) that is easy to carry and use in the field (like a one- or two-page printout of the pertinent procedure) An inexperienced mechanic made a mistake installing a piece of equipment. The mechanic did not take a copy of the procedure with him because it was long, it used terminology that he did not understand, and he felt he under- stood the task well enough. An inexperienced mechanic made a mistake installing a piece of equipment. The procedure stated only to remove the old item and replace it with a similar unit. This was not detailed enough for the inexperienced mechanic. The operator did not use the procedure because of its numerous cross- references to other procedures. To carry all of them would have required a large notebook."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 114,
    "text_chunk": "Was the procedure classified for training and reference? Based upon the significance or difficulty of the job, should the procedure have been classified as a use every time procedure? Procedures Procedures classified as reference procedures should contain very few Not Available o steps. If the number of steps is too overwhelming for short-term Obtain memory, it should be classified as a use every time procedure  Training and reference manuals may need to be supplemented by:  easy-to-carry checklists that parallel the procedure biffcat to Use  more detailed step-by-step procedures for use every time if the training and reference manuals are too cumbersome Ont enn Examples An operator made a valving error, resulting in a tank overflow. He did not take a copy of the procedure with him because it was for reference, and he No Procedure thought he knew how to perform the valving operation. O A mechanic incorrectly performed a repair job on a key pump without using the procedure. Mechanics were not required to use the procedure in the field because it was for training purposes only. However, using the procedure in the field would probably have prevented the error made by the mechanic. PROCEDURES Root Cause ANAtysis HANDBOOK Typical Issue Procedures Was there a procedure for this task? Typical Recommendations  Develop a procedure for the task  Ensure that all modes of operation, all maintenance activities, and all special activities have written procedures Not Available or Inconvenient to Obtain Procedure Difficult to Use Use Not Required but Should Be ere tll LTE Cs Example A mechanic under-torqued a flange. He performed the job without a proce- dure because one did not exist for the task."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 116,
    "text_chunk": "Was an event caused by an error made while following or trying to follow a procedure? Was the procedure misleading or confusing?  Ensure that procedures are in a standard, easy-to-read format  Ensure that procedures use the appropriate level of detail for the complexity and fre- quency of a task Use look-up tables instead of requiring calculations to be performed Use specific component identifiers An operator incorrectly completed a step of a procedure requiring him to open six valves. He skipped one of the valves. The procedure did not have a checkoff space for each valve. An operator overfilled a tank. The procedure required him to calculate the running time of the fill pump. A look-up table with the initial tank level and the corresponding fill pump run time should have been provided."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 117,
    "text_chunk": "Did the layout of the procedure make it difficult to follow? Did the format Procedures Misleading/ Confusing ee) cle my More Than One Action per Step No Checkoff Space Provided but Should Be Inadequate Checklist Ambiguous or Confusing Instructions/ Requirements Data/ Computations Wrong/Incomplete Insufficient or Excessive References Identification of Revised Steps LTA Level of Detail LTA Difficult to Identify PROCEDURES differ from that which the user was accustomed to using? Were the steps of the procedure logically grouped? Do warnings or cautions contain information that should be contained in procedure steps? Are important warnings and cautions embedded in proce- dure steps? Is the procedure format appropriate for the task? Is a flow chart used when a checklist is more appropriate? Is a checklist used when a T-bar format is more appropriate? Ensure that procedures are in an easy-to-read format. Use color codes (or change paper color) when appropriate. Avoid using the narrative or paragraph format; personnel tend to get lost in a sea of print. The T-bar, flowchart, or checklist formats are highly effective Choose one or two effective formats and use these same formats consistently throughout the facility. The format for a troubleshooting guide may be inappropriate for a step-by-step startup procedure List procedure steps in a logical, sequential order. Also, be sure that any special precautions are listed at the beginning of the procedure Review procedures to ensure that warnings and cautions are presented in a consistent format in all procedures Involve procedure users in the procedure development process. Have an inexperienced user review the procedure to ensure that sufficient detail is provided Use checklists for verification processes and initial alignments of sys- tems Use flowcharts when decisions affect which part of the procedure is implemented (e.g., a troubleshooting guide, or an emergency proce- dure that requires diagnosis of the problem) AppENDIX A  Root Cause Map Nope Descriptions } A-119] An operator made a mistake while performing a startup procedure. The procedure was confusing because it required the operator to complete part of section A, then B, back to A, then to C, back to A, then to D and E. The operator failed to go back to A after completing C. Each step in the procedure was numbered. Subsequent levels of substeps were numbered by adding a decimal point and another set of numbers. The procedure used too many levels on substeps (i.e., a step was numbered 2.3.6.5.1.1.1.1.5). As a result, the operator skipped a step in the procedure. A troubleshooting guide was developed using a checklist format. The mechanics did not understand how to move through the procedure; they just completed the items they thought were appropriate. A procedure was developed by an engineer in a paragraph format. About half of the information in the procedure was design information that the operators did not need."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 119,
    "text_chunk": "Did any steps in the procedure have more than one action or direction to perform? Did some steps in the procedure state one action, which, in prac- tice, actually required several steps to perform? Procedures Misleading/ Confusing  Avoid broad procedure steps such as Charge the reactor. Instead, use this as a subheading and include all the steps associated with charging the reactor below the heading Do not assume that an employee will remember all the steps associated with an action item. Clearly communicate all the required steps associ- ated with an action item so that the least experienced employee can successfully perform the required job tasks Format Confusing or LTA More Than One Pee No Checkoff Space Provided but Should Be Example An operator failed to close a valve, resulting in a tank overflow. The instruc- tion to close the valve was one of six actions required in one step of the procedure. He completed the other five actions but overlooked closing the valve, which was the fourth action in the step."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 120,
    "text_chunk": "Was an error made because each separate action in a step did not have a checkoff space provided? Is the procedure complex and critical enough to require checkoffs? Procedures Misleading/ Confusing  For actions that require multiple steps, ensure that all the steps are specifically defined. When appropriate, include a checkoff space for each of these individual steps so that the employee can be certain that he/she has performed this step  Itis a good practice to design procedures with enough white space (by indentation, line spacing, etc.) to allow users to keep their place when using the procedure Format Confusing or LTA More Than One Action per Step Ret Coil Space Provided LSet Example An operator failed to open a valve. The procedure required him to open seven valves. He missed one, opening the other six. A separate checkoff Inadequate space for each valve manipulation was not provided in the procedure."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 121,
    "text_chunk": "If a checklist was necessary, was it confusing? Was enough room provided for the response or did it require unique responses for each step? Did each instruction (regardless of format) clearly indicate what was required? Was a detailed checklist required for a task that was not very important? Develop a checklist for all safety-critical tasks to provide a quick refer- ence for inexperienced and experienced users  Require that checklists be turned in if necessary for quality assurance Avoid using checklists instead of supervision to ensure that tasks are performed correctly because checklists can easily be filled out before or after the task; if supervision is required, then provide a supervisor Include the unique system response to be expected when an employee completes each step of a checklist Provide enough white space on the checklist so that the employee may record the system response so that expected as well as unexpected responses can be documented Ensure that checklists are only developed for critical tasks. Overuse of checklists will reduce their effectiveness on critical tasks Format Confusing or LTA More Than One Action per Step No Checkoff Space Provided but Should Be TE CoCr TULL belted ig An operator failed to complete one step of a procedure. The procedure required a check at the completion of each step. Because it did not require unique responses for the steps, the operator completed the procedure and then checked off all the steps at one time. t Ambiguous or Confusing Instructions/ Requirements A checklist was designed so that the desirable answer to most questions (23 out of 26) was yes. As a result, the three remaining questions were often answered incorrectly."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 122,
    "text_chunk": "Was an error made because graphics or drawings were of poor quality? Were the graphics or drawings unclear, confusing, or misleading? Were graphics, including data sheets, legible? Would a graphic (diagram, picture, chart, etc.) have made a significant reduction in the likelihood of this error were it provided? For hard-copy graphics that have been reproduced, ensure that the copy is easy to read (e.g., not too dark, too light, or splotchy) Include color coding on graphics when possible for easy use  Ensure that the graphics accurately depict actual process operations and/or equipment configuration Do not overwhelm the user with too many graphics on one screen or one sheet of paper. Information should not appear crowded The text should support the graphics Flowcharts can be very effective graphics for tasks that require decision making and branching A mechanic replaced the wrong seal on a large piece of equipment. The seal that he was to remove was shaded on the drawing, but he could not deter- mine which seal was shaded because the copy was of poor quality. An electrician incorrectly terminated a wire. The wire terminations were shown on the installation diagram. The procedure copy he was using was not legible because it was made from a copy of a copy of a copy of the original. An operator opened two valves in the wrong sequence during a complex procedure to backwash an enclosed rotary filter containing highly reactive peroxides. A diagram of the filter (showing equipment labels) and proper labeling of the filter valving would have greatly clarified the procedure. An operator had to determine if the reactors temperature and pressure were acceptable. The acceptable temperature was dependent on the pressure. The operator had a long set of look-up tables that listed the acceptable tempera- ture for each pressure. A pressure-temperature graph indicating acceptable and unacceptable regions would have reduced errors."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 123,
    "text_chunk": "Were the instructions in the procedure unclear? Could they be interpreted in more than one way? Was the language or grammar unclear/complex? Have procedures validated by a team of subject matter experts (work- ers) and by walkthroughs in the field To find difficult steps, have the newest employee walk through the procedure without coaching  Allow technical editors to review procedures to ensure that ambiguous terms have been avoided  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures but Should Be An instruction called for cutting XYZ rods into 10-foot-long pieces. The intent was to have pieces 10 feet long. The person cutting the pieces cut 10 pieces, Checklist each a foot long. A step in the root cause analysis procedure stated Use the RCM to assist in determining the management system deficiencies that contributed to the event. The supervisor assumed it meant to use reliability-centered mainte- nance not the Root Cause Map."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 124,
    "text_chunk": "Was the error made because of a mistake in recording or transferring data? Were calculations performed incorrectly? Was the formula or equation confus- ing? Did it have multiple steps? Note: Consider dual coding with Ambiguous or Confusing Instructions/ Requirements or More Than One Action per Step  Avoid procedures that require employees to make manual calculations. Instead, provide employees with pre-calculated tables or worksheets with easy-to-fill-in blanks and with thorough training in their use. Or, automate calculations within the system  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures Example A procedure required the operator to calculate the weight of product in the tank based on the empty weight of the tank and the current weight of the tank. Both of these values were displayed on the computer. The operator made an error in subtracting the numbers."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 125,
    "text_chunk": "Did the procedure refer to an excessive number of additional procedures? Did the procedure contain numerous steps of the type Calculate limits per proce- dure XYZ? Was the procedure difficult to follow because of excessive branch- ing to other procedures? Did the procedure contain numerous steps of the type If X, then go to procedure ABC. If Y, then go to procedure EFG? Did the procedure contain numerous references to other parts of the procedure? Did it contain steps of the type If the material is acceptable, go to Step 13.3. If the material is unacceptable, go to Step 12.4. If the test cannot be run, redo Step 4 and contact your supervisor.  List all information that an employee must have in order to perform a specific task in the procedure designated for this task. If the same infor- mation is required to perform different tasks, repeat the information in each procedure Do not branch (reference) to more than one other procedure (module) from a procedure Procedures intended for step-by-step use in the plant/field need to contain all required tasks; an employee is unlikely to return to the file/ manual to get any referenced procedure  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures Use a flowchart to determine the correct procedure steps to be imple- mented. Avoid too many jumps within a procedure Example An operator exceeded an operating limit. The primary procedure did not contain the limits but referred to four other procedures to find the limits. When checking his results against the limits, he looked at the wrong limit in one of the referenced procedures."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 126,
    "text_chunk": "Was the procedure user required to carry out actions different from those he was accustomed to doing? Did the procedure identify that the step for the action had been revised? Did the procedure user perform the action as the previous revision specified rather than the current revision?  Ensure that procedure changes are managed, and that all official copies are updated and all unofficial copies destroyed Clearly identify (such as with a sidebar) which steps/information have changed, and ensure that all employees are trained in or informed of changes  Avoid the use of multiple area references within a procedure Format Confusing or LTA More Than One Action per Step No Checkoff Space Provided but Should Be Inadequate Checklist Example An operator incorrectly completed a step of a procedure. The operator was experienced and performed the action as he always had. The new procedure (which had been correctly updated) was not marked to indicate that the step had recently been revised, and the operator did not realize that a change had been made."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 127,
    "text_chunk": "Do the procedures provide too little detail to ensure proper performance of the task by the most inexperienced operator? Do the procedures have too much detail? Typical Recommendation Consider using an outline format with high level steps for experienced users and detailed steps for inexperienced users The instructions for a computer software program just stated change the loading preferences to user-defined values. No further directions were provided on how this could be done. An engineer developed a procedure in paragraph format. About half of the information in the procedure was design information that the operators did not need. An operations procedure for the shutdown of the cooling water system included specific steps on how to close manually operated valves. This information was not needed in the procedure because it was a common operator skill that did not require any task-specific knowledge."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 128,
    "text_chunk": "Is it difficult to identify the correct procedure to use? Do many procedures have similar names? Are the procedures for different units clearly distinguish- able from one another?  Include a header at the top of each procedure page that includes the procedure number, page number, procedure revision, and unit number  Use different colored paper for each units procedures (i.e., blue for Unit 1, pink for Unit 2) Provide clear, descriptive names for each procedure An operator used the wrong procedure to start up compressor 3A. There were three procedures labeled Startup of Compressor 3 (for compressors 3A, 3B, and 3C). The procedure he used was for compressor 3C. A mechanic incorrectly calibrated a pressure transmitter. A page from a similar procedure was inadvertently substituted into his calibration procedure. Individual procedure pages did not contain procedure titles or procedure numbers, so the substituted page was difficult to distinguish from the others."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 129,
    "text_chunk": "Was the procedure incorrect? Did the procedure fail to address a situation that occurred during performance of the task? Is the procedure consis- tent with the installed equipment? Ensure that procedures are technically reviewed  Perform a walkthrough of procedures A mechanic made a mistake calibrating a piece of equipment because the procedure specified the wrong limits. An operator ruined a batch of product when he incorrectly operated the computer control system. New software had been installed, but the proce- dure had not been updated to be consistent with the new software. PROCEDURES AppENDIX A  Root Cause Map Nope Descriptions Procedures Wrong/Incomplete aN icy aie Sequence Wrong Facts Wrong/ Requirements Not Correct Wrong Revision or Expired Procedure Revision Used Inconsistency Between Requirements Incomplete/ Situation Not Covered Overlap or Gaps Between Procedures Typical Issue Was a typographical error in the procedure responsible for the event? Use aword processor to electronically spell-check the procedure imme- diately after it has been typed  Allow a technical editor to review procedures for typographical errors Allow employees to review procedures for accuracy. Solicit feedback from employees An operator made a mistake because the procedure contained the wrong limit. The maximum temperature was supposed to be 38 C, but the proce- dure said 48 C. The mistake was made during typing and not caught by the validators. An operator overfilled a tank because of a procedure error. The procedure should have stated Hold the valve open for 3-4 seconds. The typist inad- vertently removed the hyphen (when the spell-checker in the word processing software flagged this potential misspelling) and the procedure then read, Hold the valve open for 34 seconds. PROCEDURES Ger Root Cause ANAtysis HANDBOOK Procedures Wrong/Incomplete Typographical Error Seen ci] Typical Issue Were the instructions/steps in the procedure out of sequence?  Have procedures validated by a team of subject matter experts (work- ers) and by walkthroughs in the field  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures Example An operator made a mistake because the steps were out of sequence ina procedure. Step 5 directed the operator to transfer material from Tank A to Tank B. Step 7 directed the operator to sample the contents of Tank A before transferring."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 132,
    "text_chunk": "Was specific information in the procedure incorrect? Did the procedure contain current requirements? Did the procedure reflect the current status of equipment? Procedures Wrong/Incomplete Have procedures validated by a team of subject matter experts (work- ers) and by walkthroughs in the field  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures Typographical Error Sequence Wrong Example A safety limit was violated because the procedure did not contain the current limits. The limits had been changed, but the master procedure had not been revised."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 133,
    "text_chunk": "Was specific information in the procedure incorrect? Did the procedure contain current requirements? Did the procedure reflect the current status of equipment? Was an older version of the procedure used because it was too difficult to obtain a current copy? Ensure that only current copies of procedures are available Seek out and destroy old versions of the procedures  Consider incorporating information added by operators to their per- sonal copies of procedures A safety limit was violated because the procedure did not contain the current limits. The limits had been changed, but the master procedure had not been revised. An operator liked to use his marked-up version of the procedure because it contained the system operating limits, which were contained in a different procedure. The operator always checked his personal version for updates, but he missed adding a recent change. As a result, he shut down the process when he performed the procedure incorrectly."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 134,
    "text_chunk": "Did different procedures related to the same task contain different require- ments? Were there conflicting or inconsistent requirements stated in different steps of the same procedure? Were requirements stated in different units? Have procedures validated by a team of subject matter experts (work- ers) and by walkthroughs in the field  Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures An operator exceeded the environmental discharge limits. A caution in the procedure stated the flow rate limit in pounds per hour of material. The procedure step stated the limit in gallons per minute. The operator set the flow rate based on the gallons per minute limit, which was less restrictive in this case. The procedure said to send the completed form to the PSM Coordinator, but the form itself had a note on the bottom that said to send it to the operations manager. A caution stated that the cover of the detector should not be opened until power was disconnected (after Step 12). But Step 9 said, After removing the cover, push the red button to discharge the capacitor."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 135,
    "text_chunk": "Were details of the procedure incomplete? Was sufficient information pre- sented? Did the procedure address all situations likely to occur during the completion of the procedure? Was a critical step missing? Note: This node addresses specific issues that are not included in a proce- dure. If procedures in general do not have a sufficient level of detail, consider coding under Level of Detail LTA (Procedures, Misleading/Confusing).  Ensure that all modes of operation, all maintenance activities, and all special activities have written procedures Perform a hazard review of critical procedures to determine other accident scenarios related to errors in procedures and to determine if sufficient safeguards are provided against employees not following the written procedures A mechanic did not correctly replace a pump. The instruction stated to replace the pump. Numerous actions were required to replace the pump, including an electrical lockout, which was incorrectly performed. A severe decomposition and release of chlorine occurred when the operator failed to check the strength of caustic in the neutralizer. The procedure did not include an instruction for this step, although most operators did perform this check."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 136,
    "text_chunk": "Are there gaps between procedures that are used in sequence? Do multiple procedures cover the same task? Develop a procedure development plan to allocate tasks between procedures  Review procedures to determine overlaps between them  Perform a walkthrough of the procedures to identify overlap or gaps between them An operator started up the plant air system using the startup procedure. He then checked the normal operations procedure and it also contained a section on starting up the system. The operator started the cooling water system using procedure CW-N-01, Normal Cooling Water System Startup. He then began the startup of three feed pumps using procedure FP-N-01, Startup of the Feed System. Gaps existed between these two procedures. Key steps were missing that were supposed to be performed after startup of the cooling water system and before startup of the feed system. A booster pump on a pipeline was not included in the maintenance or operations procedures. The divisions upstream and downstream of the pump each thought the pump was the responsibility of the other division."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 137,
    "text_chunk": "Were the capabilities and limitations of humans considered in the design, development, production, and control of systems? Is the layout of the workplace adequate? Is the work environment excessively noisy, hot, or cold? Does the task impose an excessive physical or mental workload? Can the system tolerate faults? Typical Recommendations Locate related controls and indications together  Provide employees with adequate personal protective clothing such as hearing protection, gloves, and safety glasses. Ensure that they are available in different sizes to ensure a comfortable fit  Reduce the complexity of control systems  Provide feedback to the operator so that he/she can tell if actions are performed correctly Human Factors ENGINEERING AppENDIX A  Root Cause Map Nope Descriptions ESE) Examples An operator, assigned the responsibility of monitoring a computer screen for an entire 8-hour shift, failed to detect an important signal. An operator failed to control the flow rate in a process because the flow rate meter could not be seen from the location where the flow was controlled. An operator inadvertently switched on the wrong pump because all three pumps switches looked the same and were not labeled. An operator was supposed to open cartons of materials. It was difficult to obtain utility knives from the warehouse (they never seemed to have them in stock), so the operator often used a screwdriver to open the packages. As a result, some of the items were scratched by the tip of the screwdriver."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 139,
    "text_chunk": "Did inadequate controls or displays contribute to the error? Was poor integration of controls and displays a factor? Did differences in equipment between different processes or areas contribute to the problem? Did poor arrangement or placement of equipment contribute to the event? Was there a failure to appropriately and clearly label all controls, displays, and other equipment?  Ensure that operators are provided with sufficient information to control the process Locate related controls and indications together  Follow expected norms in labeling and layout of controls and indications (e.g., left to right, top to bottom progression, consistent color codes) In one processing plant, two units performed the same function. Each unit had a separate control room. The control rooms were identical except that they were mirror images of one another. An operator, normally assigned to the first unit, caused a serious process upset when he was assigned to work in the second unit. The controller for an automatic valve was located on the front side of a vertical panel. The flow indication for the line was on the back side of the panel. A mirror was installed so the operator could see the flow indication while adjusting the valve position. However, the reversed image in the mirror caused problems in setting the correct valve position."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 140,
    "text_chunk": "Did inadequate equipment controls or control systems (e.g., push-buttons, rotary controls, J-handles, key-operated controls, thumbwheels, switches, joy sticks) contribute to the occurrence? Did the control fail to provide an ad- equate range of control for the function it performs? Was the control inad- equately protected from accidental activation? Were similar controls indistinguishable from one another? Did one switch control a number of parameters or have different functions under different conditions? Did inadequate displays or display systems (e.g., gauges, meters, light indica- tors, graphic recorders, counters, video display terminals) contribute to the occurrence? Did the display fail to provide all information about system status and parameter values needed to meet task requirements? Did the configura- tion of the display make information difficult to see or to interpret? Was it necessary for the user to convert information presented by the display prior to using it? Did unnecessary or redundant information contribute to the error? Note: Arrangement of controls is addressed by Control/Display Integration/ Arrangement LTA. The location of controls is addressed by Location of Controls/Displays LTA. Configure controls such that it would be difficult to accidentally activate them  Ensure that similar controls have distinguishable features Ensure that the device/display allows the necessary range of control (e.g., 0-100 GPM control dial would be inappropriate if the flow some- times required settings as high as 110 GPM)  Ensure that sensitivity of controls allows an operator to quickly and accurately make process changes  Ensure that displays provide enough information about the process so that the operators can adequately control it Configure displays so that they are easy to read and interpret  Ensure that similar controls have distinguishable features  Provide direct display of the necessary parameters so that operators do not have to convert the information for it to be usable  Display only the information that is necessary/helpful to safely and efficiently control the process  Avoid the use of dual purpose controls. Provide one control for each parameter being controlled Human Factors ENGINEERING Gar Root Cause ANAtysis HANDBOOK The operator of a remotely driven crane inadvertently dropped the load being raised. The keys on the keypad he was using to operate the crane were very small and close together. The operators fingers, even though they were average size, were too large to accurately press one button without inadvertently pressing the surrounding keys. During an emergency, an operator made the event worse by increasing flow instead of stopping flow. All flow controllers in the plant were moved counterclockwise to reduce flow except for the one involved in this event. It was moved clockwise to reduce flow. This violated the standard practice at this plant. An operator made an error in reading a meter because of the unusual scale progression. Instead of a scale with major markings divided by units of five (i.e., 5, 10, 15, 20), the scale was divided into units of six (i.e., 6, 12, 18, 24) A digital display was used to monitor the flow rate of a system. The system responded slowly to control changes. This required the operator to write down values at various times to create a time log. A chart recorder would have been a more appropriate type of display."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 142,
    "text_chunk": "Was there a failure to arrange related controls and displays of the readouts of these controls close to each other? Was a display arranged so that it was obscured during manipulation of the related control? Were control/display relationships unclear to the user? Was the response of a display to control movements inconsistent, unpredictable, or incompatible with populational stereotypes or with the users expectations? Was there difficulty with multiple displays being operated by a single control? Is there a clear relationship between the controls and the displays? Were controls located near the dis- plays they affected? Can the operator read the display while adjusting the control? Are control/display arrangements consistent with populational stereotypes?  Configure the control panel so that it is easy to locate related controls and displays Locate displays so that the related control can be manipulated while watching the display  Ensure that the control and its displays are directly related to one another (i.e., if pressure is displayed, the corresponding control should directly affect pressure as opposed to another parameter, like tempera- ture)  Ensure that each display responds consistently with populational stereotypes when the control is manipulated (e.g., the display shows a quantitative increase when a control is turned clockwise)  Ensure that one display is provided for every control  Ensure that there is clear mapping between the controls and displays The temperature control had numbers on the dial that ranged from 0 to 100. The temperature indication also ranged from 0 to 100 C. However, setting the dial to 75 did not result in a temperature of 75 C. An operator set the flow rate improperly. The procedure specified the flow rate in gallons per minute. The display indicated pounds per hour. The operator incorrectly started pump D instead of pump B. The pump controls are all identical and arranged in reverse alphabetical order from left to right like this: ED C BA This violates a stereotype that controls will be in alphabetical order from left to right. The controls for three pumps were arranged differently than the pumps themselves. There were three sections of lights in the room (front, middle, and back). However, the light switches were not in the same arrangement. The light switch for the back lights was located closest to the front of the room."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 143,
    "text_chunk": "Were there problems related to the location of controls or displays? Were they out of the normal work area? Locate controls in convenient locations to encourage their proper use Locate displays in convenient locations to encourage their use Locate displays so that they can be read by the average person Locate controls so that they can be easily operated by the average person Locate controls so that they are not accidently bumped A large control handle on a control panel stuck out beyond the edge of the panel when the pump was running. Someone walking past the panel acci- dently bumped the switch and shut down the pump. This resulted in a pro- cess upset. The speed control for a pump was located three floors below the normal operating area. As a result, operators ignored out-of-tolerance conditions because they did not want to go up and down the three flights of stairs. The only open space on a control panel was near the floor. As a result, a new chart recorder was installed 6 inches above the floor. To read the display, the operators had to get down on their hands and knees. Sometimes the opera- tors just looked at the display while standing and guessed at the readings. Human Factors ENGINEERING AppENDIX A  Root Cause Map Nope Descriptions Human Factors Engineering Workplace Layout Controls/Displays LTA Control/Display Integration/ Arrangement LTA Location of Controls/Displays LTA Conflicting Layout Equipment Location LTA Labeling of Equipment or Locations LTA Typical Issue Did differences in controls, displays, or other equipment between different processes or areas contribute to the event?  Ensure that color codes consistently have the same meaning on all control boards in the facility  Ensure that identical units have identical control board configurations  Label similar components in sequential order: ABC not ACB Two computer systems, located side-by-side in the facility, were programmed using different color schemes. On the first system, the color red indicated an open valve and green indicated a closed valve. On the second system, green indicated normal and red indicated an abnormal condition. Because of the inconsistency in color coding between the two systems, an operator who normally worked on the first system allowed a tank to overflow when he was temporarily assigned to the second system. His mindset was that green indi- cated lack of flow. An operator inadvertently started the wrong pump. The cooling water pumps are arranged alphabetically (A-D) from left to right. However, the control panel has the controls arranged as follows: AC BD In one processing plant, two units performed the same function. Each unit had a separate control room. The control rooms were identical except that they were mirror images of one another. An operator, normally assigned to the first unit, caused a serious process upset when he was assigned to work in the second unit."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 145,
    "text_chunk": "Is equipment (tools, work surfaces, supplies) that personnel need to perform their jobs conveniently located? Is it accessible by workers when needed?  Ask workers about problems they have encountered in locating needed tools Locate tools and supplies so that workers will have access to them when needed. Consider back shifts and weekend access Review work stations to ensure that proper ergonomics are being implemented An operator needed to make a copy of a procedure to use in the startup of a system. His printer was out of paper. The paper supply was locked in the supply room. As a result, he spent 45 minutes locating enough paper by taking it from other printers. All tools were returned to a central tool crib each night. As a result, mechanics spent 30 minutes at the beginning of each day obtaining the tools they needed for the day and 20 minutes returning them at the end of each day. All batch recipes were supposed to be shredded after use in the field. How- ever, the only shredder was on the other side of the plant. As a result, many operators just threw them in the waste basket."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 146,
    "text_chunk": "Was there a failure to appropriately and clearly label all controls, displays, or other equipment items that had to be located, identified, or manipulated by the user during performance of a task? Did labeling fail to clearly identify equipment? Did labeling incorrectly identify equipment? Were labels hard to read, incorrect, or misleading? Workplace Layout Contrls/Dispiays Typical Recommendations LTA  Ensure that all controls and displays are labeled correctly * Ensure that labels are made with an easy-to-read font and are color i ControuDispiay coded if necessary integration Arrangement LTA * Locate all labels close to the related control/display Maintain labels as necessary (clean, ensure reliable adhesive, etc.) Location of  Ensure equipment locations or locations of materials are properly Controls/Displays labeled LTA  Ensure equipment bins in the warehouse are properly labeled Conticting Examples Layout An operator selected the wrong valve from a configuration of 20 valves because more than half of the valves in the group were unlabeled. The _ Equipment adhesive used to attach labels to the valves was not reliable in the acidic environment in which the valves were located; therefore, many of the labels had fallen to the floor. The operator tried to judge which was the correct eid valve using the labels that remained attached. eeu ole Locations LTA An operator opened the wrong valve, causing a transfer error. The label was positioned between two valves, forcing the operator to choose between them. A row of bins in the warehouse contained different types of bolts. The labels for the bins had part numbers on them, but no equipment descriptions. As a result, some items were incorrectly restocked after being returned to the warehouse."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 147,
    "text_chunk": "Did stressors in the work environment, such as poor housekeeping, extreme heat or cold, inadequate light- ing, or excessive noise, contribute to the error? Was the problem caused by difficulties associated with protective clothing? Were there other stressors present in the work area that may have contributed to the problem (e.g., vibration, movement constriction, high jeopardy or risk)? Were the right tools available to do the job? . . An operator received a cut to her head when she bumped into an overhead pipe. The lighting in the area red Ps Housekeeping LTA Protective Clothing/ Equipment LTA Ambient Conditions LTA Other Environmental Stresses Excessive Remove unused equipment and piping Provide employees with adequate personal protective clothing such as hearing protection, gloves, and safety glasses. Ensure that they are available in different sizes to ensure a comfortable fit Ensure that the right tools are available to do the job was not sufficient to detect overhead obstacles. A step was missed during performance of a job. The operator hurried through the job because it required him to wear a respirator and work in a confined space. None of the available respirators fit comfortably."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 148,
    "text_chunk": "Did poor housekeeping conditions contribute to the event? Was the error caused by a cluttered work environment? Was an unsafe situation created by a sloppy workplace?  Ensure that work areas are maintained in a clean, organized manner * Remove (demolish) unused equipment and piping Example A mechanic received a puncture wound to his hand when he reached into a tool box and came into contact with an open pen knife. The tool box was full of old rags and crumpled paper; therefore, the mechanic was unable to detect the hazard. An operator needed to check the operating records from a couple months ago. The records were stored on magnetic tape cartridges. The cartridges were labeled, but were just thrown in a drawer. As a result, it took the opera- tor 25 minutes to locate the correct tape."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 149,
    "text_chunk": "Engineering Were the proper tools supplied to do the job right? Were the tools in good condition? Work Typical Recommendations Environment Provide the right tools to do the job right * Ensure worn tools are repaired or replaced Housekeeping LTA Example A maintenance helper was assigned the task of checking batteries in smoke alarms in the office areas of the plant. He was not allowed to use a voltmeter to check the condition of the 9-volt batteries (only electricians could use voltmeters). So he stuck the batteries on his tongue to see if they were still Protective good. Clothing/ , ; | Equipment LTA A carpenter was using a hammer with a worn handle. When he was pulling out a nail, the handle broke and the carpenter injured his elbow."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 150,
    "text_chunk": "Did protective clothing or equipment (e.g., plastic suit, gloves, respirator) contribute to the difficulty? Did protective clothing or equipment significantly diminish any of the senses (i.e., sight, touch, smell, hearing, or taste) neces- sary to perform the task? Were personnel required to wear protective clothing or equipment for an uncomfortable length of time? Were personnel required to dress in and out of protective clothing an excessive number of times?  Ensure that protective clothing is available in different sizes so that all employees can be properly fitted  If several consecutive tasks require that protective clothing be worn for a long time, investigate the possibilities of using more comfortable protec- tive clothing designs (e.g., looser or tighter fit) or protective clothing made with more comfortable material (e.g., breathable fabric) If protective clothing diminishes senses required to complete the task, investigate altering the clothing, if possible, so that personnel may perform their duties effectively An operator wearing a full-face respirator was injured when he walked into the path of a forklift. The respirator reduced his peripheral vision; therefore, he did not see the forklift coming from his left side. An operator using an overhead crane allowed the load to collide with operat- ing equipment. The protective gloves he was wearing prevented him from accurately manipulating the cranes controls. An operator splashed some alkaline catalyst onto his hands, causing a severe chemical burn, while manually loading the catalyst into a vessel. The operator was wearing gloves, but the gloves were not chemically resistant."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 151,
    "text_chunk": "Was the event caused by excessive exposure of personnel to a hot or cold environment? Was poor ventilation (i.e., poor air quality or inadequate air velocity) a contributor to the event? Was the effect of rain, snow, etc., a factor? Was the event caused because illumination levels were not sufficient for task performance? Did the level of illumination vary greatly over a given work station? Was the error caused by failure to provide supplemental lighting for personnel performing specialized visual tasks in areas in which fixed illumina- tion was not adequate? Was there shadowing of labels, instructions, or other written information? Was there a problem with glare or reflection? If the event occurred during an emergency situation, such as loss of power, was emer- gency lighting inadequate? Was the event caused by diminished human performance caused by exces- sive noise? Were personnel unable to hear auditory signals or alarms because of excessive background noise? Did auditory distraction, irritation, or fatigue of personnel result from excessive noise?  Ensure that indoor work areas are adequately ventilated and heated/ cooled Allow personnel to take frequent breaks if they are required to work in an uncontrolled, uncomfortable climate for extended periods of time Consider the need for roofing or walls over work areas for which protection from wind and precipitation reduces the hazards of operation and maintenance Solicit comments from employees regarding work station lighting. Address any comments received Provide nonglare screens for computer monitors Conduct an emergency drill at night and use emergency lighting. Solicit employee feedback to determine whether or not the lighting is adequate for emergency operations/evacuation Install additional equipment to diminish workplace noise when possible (e.g., mufflers, sound enclosures) Post danger signs in areas in which noise is in excess of 85 dB to alert employees to wear hearing protection in those areas Ensure that emergency alarms and the emergency public address system can be heard throughout the process area Human Factors ENGINEERING AppENDIX A  Root Cause Map Nope Descriptions Eee During an extreme cold spell, a mechanic damaged an expensive piece of equipment by dropping a tool into its moving parts. Even though the mechanic was wearing gloves, his hands were so cold that he was unable to get a firm grip on the tool. A serious incident occurred when glare caused by improper overhead lighting prevented an operator from detecting that an important annunciator tile was illuminated. During a loss of power event, an operator was injured while attempting to troubleshoot the emergency generator. Lighting levels from the control room to the generator were insufficient, and he ran into a forklift on his way to the generator. A computer operator failed to respond to a system alarm because background noise from the computers cooling fans masked the auditory alarm signal."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 152,
    "text_chunk": "Engineering Was the error a result of environmental stressors other than poor housekeep- ing, inadequate climate control, poor lighting, a noisy work area, or problems with protective clothing? Was the worker rushed to get the job done? Was Work there pressure to get the job done to allow the system to be restarted? Did he/ Environment * : she perceive that he/she was at risk? Typical Recommendation  When possible, reduce certain physiological and psychological stresses such as:  pain or discomfort caused by seating, etc.  hunger or thirst Housekeeping LTA Co  vibration ,  movement constriction Clothing! di i f circadian rhyth Equaen LTA  disruption of circadian rhythm  high-risk job  perceived threat (e.g., of failure or job loss)  monotonous, degrading, or meaningless work Conditions LTA Examples Other atl A jackhammer operator was injured when he dropped his jackhammer on his ree foot. He had been using the tool for several hours without relief, and the constant vibration caused his hands to fall asleep. This weakened his grip and caused him to lose control of the jackhammer. Working in a confined space contributed to an event because personnel rushed through the job to get out of the higher-risk environment."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 154,
    "text_chunk": "Human Factors Engineering Work Environment Housekeeping LTA Protective Clothing! Equipment LTA Ambient Conditions LTA Other Environmental Stresses Excessive Dee) Excessive Control Action Requirements Unrealistic Monitoring Requirements Knowledge-based Decision Required Excessive Calculation or Data Manipulation Required Intolerant System Errors Not Detectable Errors Not Correctable Were too many tasks required for the number of available operators? Was the error caused by a situation or system being complex and requiring a decision based on specific knowledge for a successful outcome? Were system controls so complex that they contributed to user error? Did the system impose unrealistic monitoring or mental processing requirements? Provide tools to make decision making easier and to reduce the chances of human error  Reduce the complexity of control systems * Do not place workers in situations requiring extended, uneventful vigilance Eight maintenance tasks were in progress at the same time. The control room operator had to perform some steps for each of these tasks. He was to transfer the contents of tank A to tank B to support one of the maintenance tasks. While he was involved with another task, tank B overflowed. The audible alarm on the toxic gas detector was inoperable. An operator was assigned to watch the toxic gas meters for an entire 8-hour shift to detect a toxic gas release. The operator failed to notice a release when it occurred."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 155,
    "text_chunk": "Were the system or equipment controls so complex that they contributed to or caused the event? Could the system have been designed with simpler controls so that the chance of error was reduced? Automate the system so that an employee is not required to constantly manipulate controls Reduce the complexity of the control system demands on the operator Make the system more stable to reduce the number of control adjust- ments required A worker operating an automatic lift inside a glove box was required to operate two sets of hand controls simultaneously. These controls were located on the exterior of the glove box. One set of buttons, located on the left of the glove box, controlled the up/down motion of the lift. The other set, located on the right side, controlled side-to-side motion. While operating the lift, it was necessary for the operator to have one hand in a gloveport to balance the load. The load on the lift fell when the operator momentarily removed his hand from the gloveport to operate the controls. The thickness of a sheet material needed constant monitoring and adjustment by the operator (15 to 20 times an hour). When other activities required his attention, out-of-tolerance conditions could go uncorrected for 5 or 10 minutes."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 156,
    "text_chunk": "Were personnel required to monitor more than three variables at once, caus- ing overload or failure to notice important information? Could the error be attributed to loss of alertness because of the excessive length of a monitoring task?  Automate the system so that an employee is not required to monitor several variables simultaneously. However, provide enough employee interaction with the system to keep personnel alert Do not place workers in situations requiring extended, uneventful vigilance  Ensure that staffing levels are adequate An operator given the responsibility for temporarily monitoring the alarms for another unit allowed a tank to overflow. He acknowledged the audible level alarm for the tank, which resulted in muting of the horn. He meant to return to the problem; however, an alarm from one of the other systems sounded, and his immediate attention was required there. The tank associated with the first alarm overflowed before he was able to take appropriate action. A radar operator was given the responsibility for monitoring a screen for blips during an entire 8-hour shift. As a result of a decrease in vigilance, the opera- tor failed to identify an important signal. Because of reductions in staffing levels, an operator was given the added responsibility of monitoring the operation of the flare system that serves several units, including his own. The operator can easily perform these duties during normal operations; however, during nonroutine modes of operation (e.g., startup), the operator is unable to monitor the flare system because of increasing responsibilities in his own unit. Inattention to the flare system may cause the flare system to fail to function properly, allowing a release of un- burned process material to the atmosphere."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 157,
    "text_chunk": "Was the error caused by a situation or system being complex and requiring a decision based on specific knowledge for a successful outcome? Could better design have been reasonably expected to eliminate the error? Do personnel have to recall infrequently used information to adequately perform the task? Is it reasonable for a person to remember the information, or should it be provided on the equipment or in a procedure?  Modify system design to eliminate knowledge-based decision making Ensure that enough time is provided to complete the knowledge-based decision  Provide tools (such as decision trees or flowcharts) to make decision making easier and to reduce chances of human error  Provide adequate staffing to reach a knowledge-based decision During an emergency situation, more than 80% of the annunciator tiles in the control room illuminated at once. The operators on duty were used to re- sponding to a single alarm at a time using very specific procedures. In this situation, they did not have enough specific knowledge of how the various systems interacted; therefore, they were at a loss in determining the appropri- ate method of response. As a result, the operators responded to a few alarms in the wrong priority, worsening the event. In this case, knowledge of the overall system was required, and the procedures provided were useless. The clock on a data recording unit needed to be advanced 1 hour for the switch to daylight savings time. The process for doing this was not obvious as there were no time-set buttons on the device. No procedure or directions were available for this task either. As a result, the operator tried a number of different ways before succeeding. A line had to be flushed to clear out some contaminants. This process was only performed a few times a year. No procedure was developed for this process because it was performed so infrequently. The operator used his best judgment in performing the lineup but failed to close one valve. The backflow through this line resulted in an exothermic reaction in one of the supply tanks."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 158,
    "text_chunk": "Was the error due to the need for excessive mental processing by personnel? Were personnel required to work through complicated logic sequences or other written instructions? Did the task require that personnel commit exten- sive amounts of information to memory? Were personnel required to carry out mental arithmetic?  Provide workers with the information they need (e.g., procedures, calculated tables) instead of relying heavily on their mental capabilities (e.g., memory, mental calculations)  Provide the information that workers need in the simplest form possible  Anticipate the types of conditions workers may encounter and provide the information they will need under each of these conditions In order to determine the amount of acid to add to a particular mixture, an operator was required to take readings from three meters and perform a mental calculation. The operator made a mental error in performing the arithmetic and added the wrong amount of acid to the tank. An operator was attempting to determine if the present plant condition was acceptable. To do this, the operator had to determine the pressure and tem- perature of a vessel, then use a 60-page table to determine if the vessel had adequate subcooling by determining the saturation temperature for the pressure of the vessel. Then he compared the vessel temperature to the saturation temperature. This task could have been simplified by using a graph, a job aid, or letting the plant process computer perform the task."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 159,
    "text_chunk": "Were personnel unable to detect errors (by way of alarms or instrument readings) during or after the occur- rence? Was the system designed such that personnel were unable to recover from errors before a failure occurred? Ensure that important safety-related equipment is adequately equipped with error-detection systems Provide feedback to the operator so that he/she can tell if procedure steps are performed correctly  Design tasks and equipment to allow time to detect and correct errors for safety-critical tasks and equipment An operator was simultaneously filling two large vessels with gasoline. While attending to one of the vessels, he allowed the other one to overflow because no level alarms or indicators were provided to let him know that the vessel was reaching its capacity. An operator thought he closed a valve on the feed line to a tank. However, the valve stem was binding and the valve was half-open. No position indicator was provided for the valve and no flow indication was provided for the line."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 160,
    "text_chunk": "Were personnel unable to detect errors (by way of alarms or instrument readings) during or after the occurrence? Did a serious error go unnoticed because no means were provided to monitor system status? Note: Consider dual coding with Controls/Displays LTA (Workplace Layout). Intolerant System  Ensure that important safety-related equipment is adequately equipped with error detection systems  Ensure that systems important to reliability and quality are equipped C sa > with error detection systems Errors Not Correctable An operator intending to stop flow to a tank accidentally turned the wrong valves. No level alarm was provided on the tank to indicate that overflow was imminent; therefore, the tank overflowed. The alarm limits for cooling water flow were set very close to the normal values. The alarm went off frequently. The operators learned to ignore the alarm because it was part of normal operations. As a result, when cooling water flow stopped because of a failed pump, the operators did not respond. A warehouse stock person obtained the wrong bolts for a job. The bolts were in bins that were only labeled with the part numbers; no part descriptions were included. Small parts like these were not labeled with part numbers. As a result, the stock person could not check that the materials in the bin were the ones that were supposed be there. An operator attempted to open a block valve underneath a relief valve. The gate separated from the stem, so even though the valve appeared open (based on stem position), the gate was still closed and obstructing the pressure relief valve inlet. ener e ener eee eee Human Factors ENGINEERING Ba Root Cause ANAtysis HANDBOOK Typical Issue Was the system designed such that personnel were unable to recover from errors before a failure occurred? Human Factors Engineering Design safety-related equipment so that the detected errors can be corrected before system failure occurs * Design tasks and related procedures to allow employees time to detect Intolerant System Errors Not Detectable and correct errors for safety-critical tasks Examples Errors Not Ld A computer operator started an automatic operating sequence, controlled by a distributed control system, before the valving lineups in the process area had been completed. Even though operators in the field called in to tell the operator to stop the operation, the computer was not programmed to allow interruption of the sequence. As a result, process flow was routed to waste. A low tank alarm occurred, indicating insufficient level for the pump drawing suction from the tank. By the time the operator responded to the alarm, the pump was already damaged. Samples were drawn of each batch prior to shipment. However, the batches were often sent out before the analysis of the samples was complete. As a result, when a sample indicated an unacceptable batch, the delivery could not be stopped before it reached the customer. The customer had to be called and asked to ship the batch back."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 162,
    "text_chunk": "Was training provided on this task? Was the train- ing sufficient to perform the task? Did the training correspond to the actual work environment? Were training records adequate?  Provide training in the hazards of the process and job tasks  Provide refresher training in appropriate areas  Solicit comments from the trainees after they have been on the job for 3 months to deter- mine holes in the training program  Ensure that instructors are properly qualified  Provide training on tasks critical to reliability and quality Example A solvent tank overflowed because the operator had not been trained on how to calculate the liquid level of a solution with a specific gravity less than water."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 163,
    "text_chunk": "Had training on the task been developed? Had training been conducted? Did the individual(s) involved in the event receive training? Had the training requirements been identified? Was a decision made to not train on the task?  Provide training in the hazards of the process and job tasks Provide refresher training in appropriate areas  Provide a written description of the training requirements associated with a specific job title Provide training on tasks critical to reliability and quality A solvent tank overflowed because the operator had not been trained on how to calculate liquid levels of tanks. Training was not required on this task because it was assumed to be a skill of the trade. However, the operators were not experi- enced with solvents and solutions with specific gravities less than water. An operator made a mistake in weighing materials. A new computerized scale had been installed a month before. Training was not provided in the use of the new scale even though it was signifi- cantly different from the mechanical type that had been used in the past."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 164,
    "text_chunk": "Was the decision made to not provide specific training on a task? Were some employees not required to receive training? Was experience considered a substitute for training?  Provide training in the hazards of the process and job tasks associated with normal operations, nonroutine operations, and emergency opera- tions  Provide training for maintenance tasks such as inspection, testing, calibration, preventive maintenance, repair, replacement, and installa- tion  Provide refresher training annually for all employees in their assigned duties A solvent tank overflowed because the operator did not know how to calcu- late the liquid level. The operator was not required to receive training because he had years of experience working in a similar facility. However, the previous facility did not use solvent, and the operator did not have experience with solutions with specific gravities less than water. Management decided to only train one mechanic to repair a special digital processor used in the lab. However, while this mechanic was on vacation, the digital processor broke and another mechanic had to fix it."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 165,
    "text_chunk": "Was training on the task part of the employees training requirements? Had the necessary training been defined for the job description? Identify all of the specific duties associated with each job title. Include pertinent topics associated with these duties within the corresponding training module Provide a written description of the training requirements associated with a job title. Require that each employee complete the training and qualification associated with his/her job title before performing specific job tasks unsupervised Example An operator overflowed a solvent tank because he did not know how to calculate liquid levels. The operator had transferred from a similar facility, and the training required for his present assignment had not been defined. Since the other facility did not use solvent, the operator did not have experience working with solutions with specific gravities less than water."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 166,
    "text_chunk": "Was the training record system complete and up- to-date? Did it accurately reflect the employees training? Were the records used to determine worker selection and assignments to tasks? Document the training that an individual is required to receive prior to qualification and to maintain qualification  Ensure that individuals are assigned respon- sibilities for maintenance of training records Example A tank overflowed because the operator had not received training on how to calculate liquid levels. The training records were not routinely updated; therefore, the worker who was assigned to the job was assumed to understand this task."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 167,
    "text_chunk": "Did the records show training that the employee had not received? Did the records correctly indicate the employees qualifications? Typical Recommendations * Document the required training that an employee is required to com- plete annually ly. * Document all in-house, on-the-job, and outside training that an em- Incorrect ployee completes. Include dates of completion, test scores, instructor comments, certifications, etc., and a description of how competency is ascertained, along with these records Training Records System LTA Example An operator overflowed a solvent tank. He had been given the assignment to fill the tank because his records indicated that he had been trained on calcu- lating liquid levels of solutions with specific gravities less than water. The operator had not received the training."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 168,
    "text_chunk": "Did the training records show the employees current status for job qualifica- tion? Was the qualification expired but not reflected in the training records? Typical Recommendation  Establish a training records management system that assigns certain individuals the responsibility for:  notifying records management personnel of employee training Training Records System LTA Training Records Incorrect completion dates  recording training completion dates forwarding materials to records management personnel that verify SEU mck : woe Resin tates employee understanding of the training alerting employees and supervisors of upcoming training require- ments  scheduling employees and instructors for specific training modules Example An operator overflowed a solvent tank because he had not received training on calculating liquid levels for solvent solutions. He had been qualified before this training was made part of the qualifications. The training records still showed him as qualified because they did not reflect the new requirements."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 169,
    "text_chunk": "Were job/task analyses adequate? Were the program design and objectives complete? Did the training organization have adequate instructors and facilities? Is refresher training performed? Does testing adequately measure the employees ability to perform the task? Does training include normal and abnormal/emergency working condi- tions?  Perform job/task analyses for routine jobs/ tasks Solicit comments from the trainees after they have been on the job for 3 months to determine holes in the training program  Ensure that on-the-job training consists of doing rather than just watching  Provide refresher training for nonroutine tasks  Ensure that instructors are properly qualified A solvent tank overflowed because the operator did not know how to calculate the liquid level of solutions with specific gravities less than water. The training included instruction in how to calcu- late the liquid level but did not include testing to determine if the operator could perform the calculations. An operator made a mistake in weighing material because he used the scale incorrectly. The scale he used in training was the previous model and it had key differences from the one used on the job. A mechanic made a mistake when repairing a pressure transmitter. Some transmitters had special seals so they would work in very high humidity environments. The job/task analysis did identify that training would be needed for these different types of transmitters."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 170,
    "text_chunk": "Was a job/task analysis performed? Did it correctly identify the knowledge and skills necessary to complete the task? Did it correctly identify all the steps required to successfully complete the task? Do not discount the value of conducting a job/task analysis for some jobs/tasks that may seem trivial or meaningless Include all pertinent information in the job/task analysis, including job skills required to perform the task, the sequence of task steps, and hazards of performing each task Conduct a walkthrough of the job/task while performing the analysis in order to trigger thoughts concerning the skills required to complete the task and the correct sequence of completing the steps An operator made a mistake weighing material to be added to a solution. The operator had not received training on how to use the scale because the job/task analysis did not identify use of the scale as a skill for performing the job. A technician made an error when analyzing a sample of material. The job/ task analysis did not identify the need to dry the sample as part of the sample preparation."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 171,
    "text_chunk": "Was the training program designed to equip the trainees to perform the task? Did it contain the correct amount of classroom and on-the-job instruction? Did the objectives satisfy the needs identified in the task analysis? Did the Job/Task Analysis LTA Program Design/ fe) yt oe N Lesson Content LTA On-the-job Training LTA Qualification Testing LTA Continuing Training LTA Training Resources LTA Abnormal Events/ Emergency Training LTA objectives cover all the requirements necessary to successfully complete the task? Were the objectives written at the correct cognitive level? Provide employees with classroom and on-the-job training. After completion of the training, have the trainee physically demonstrate all tasks (without receiving direction) to ensure that the employee has received an adequate amount of training After completion of a training module, have trainees evaluate the program design. Solicit comments to improve the program design Establish an overall training management system that assigns certain individuals the responsibility for:  analyzing training needs for each job title  establishing training criteria for each job title  designing curricula to meet training needs continually assessing and improving the training program Using the job/task analysis, define and document training objectives so that employees will be equipped with sufficient skills to perform their assignments successfully Ensure that trainees understand training objectives at the start of each new training module Ensure objectives are written at the correct cognitive level. For example, the objective should be written as Use the laboratory scale to weigh a sample rather than Explain how a sample is weighed. The technicians job is to perform the task, not merely to explain how to do it. Knowing and doing are on two different cognitive levels Training AppENDIX A  Root Cause Map Nope Descriptions Ear) Examples An operator made a mistake weighing material. His formal training had contained instruction about using the scale, but on-the-job training on the use of the scale had not been required. An operator opened the wrong valve during an emergency. In training, the operator had read the procedure but had never performed the procedure in the plant or on a simulator; nor had he performed a walkthrough. An operator made a mistake weighing material because he used the scale incorrectly. The task analysis identified that training was required on the use of the scale, but the training objectives did not include it; therefore training did not stress this skill. An operator overfilled a tank. The training objectives for this system required the operator to list the compo- nents in the system, but did not include an objective to explain the function and operation of the control system."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 173,
    "text_chunk": "Did the lesson content address all the training objectives? Did the lessons contain all of the information necessary to perform the job? Was the lesson material consistent with the current system configuration and procedures? Note: This node addresses the content of lessons led by training personnel or formal training away from the job (such as classroom, laboratory, or simulator training). Problems with the content of on-the-job training are addressed under the On-the-job Training LTA node.  Ensure that the lesson content for each training module addresses all the necessary topics to guarantee a complete understanding of the required tasks Include workshops or demonstration techniques as part of the lesson content to provide a tangible and practical means of communication An operator made a mistake weighing material because of incorrect use of the scale. The lesson plan did not address training on the scale, although it was in the objectives. An operator made an error in determining the amount of material to add toa batch. The scale he used was installed 6 months before. The training he received on the system the previous month had not incorporated the new scale into the lesson content. A clerk incorrectly entered a customized order into the computer. During training, the instructor had shown her the wrong way to perform the task."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 174,
    "text_chunk": "Did the on-the-job training provide opportunities to learn the skills necessary to perform the job? Was there sufficient on-the-job training? Did the on-the- job training cover unique and unusual situations or equipment to avoid surprising the operator later on?  Ensure that on-the-job training consists of actually doing rather than only watching Match trainees with experienced personnel who can explain not only how to perform certain tasks, but also why certain tasks are performed  Ensure that on-the-job training covers unique and unusual situations or equipment An operator made a mistake weighing material because of incorrect use of the scale. He had received classroom instruction but no on-the-job experience in the use of the scale. An operator made a mistake weighing material because of incorrect use of the scale. He had received classroom and lab instruction on the use of the scale, but the scale used in the lab was the previous model and operated somewhat differently from the one used on the job. No on-the-job training was provided. Four furnaces were installed in a boiler house. They had each been installed at different times as the plant expanded. The control systems were similar, but had significant differences. During on-the-job training, the operator only operated two of the four furnaces. As a result, the operator accidently shut down one of the furnaces shortly after he was qualified."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 175,
    "text_chunk": "Did the testing cover all of the knowledge and skills necessary to do the job? Did the testing adequately reflect the trainees ability to perform the job? Was on-the-job demonstration part of qualification and was the demonstration thorough enough?  Verify that the trainee fully understood the training in some tangible manner (such as a classroom exam, physical demonstration without direction, oral exam, working with an experienced employee who is able to evaluate the trainees performance)  Ensure that all areas of the lesson content are verified for understanding (including both complex task skills and rudimentary skills) An operator made a mistake weighing material because of incorrect use of a scale. He had received instruction on the use of the scale but had not been tested on his ability to use the scale. An operator failed to close a valve in an emergency because he could not find it. Qualification testing consisted of a discussion of the procedure. A walkthrough evaluation should have been performed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 176,
    "text_chunk": "Was continuing training performed to keep employees equipped to perform nonroutine tasks? Was the frequency of continuing training adequate? Was training provided when the work methods for this task were changed? Training LTA Was training provided on changes to the procedure for the task? Was training provided on new equipment used to perform the task? Note: Problems with refresher training on abnormal and emergency opera- A jobrTast. A tions should also be coded under Abnormal Events/Emergency Training LTA. Typical Recommendations Program Design/ Objectives LTA  Provide all employees with refresher training for routine and nonroutine tasks associated with their job assignments at least on an annual basis (for operations, this would include training on startup, shutdown, Lesson Content troubleshooting, emergency shutdown, and safe work practices) * Consult employees regarding the frequency of training. Should the training be conducted more often? Less often? Should refresher training on-the-job content be revised? Training LTA * Provide additional training for new procedures, procedure modifica- tions, and process modifications involving new equipment  Ensure that the new work method training includes instructions that sean eA relate to nonroutine tasks (changes to startup, shutdown, emergency operations, etc.)  Verify understanding of the new work method to the same degree that ca is required for verifying understanding of initial training (classroom exams, physical demonstration, etc.) Training Examples Resources LTA NOOHIOBOL An operator made a mistake weighing material because of incorrect use of a scale. The scale on which he was trained had been replaced with a newer Abnormal Events/ model, and no training had been provided on the new model. Emergency Training LTA A mechanic had trouble reading a graph with a logarithmic scale. The graph had been recently added to the procedure. The training department had not been notified of the change and did not identify the need to provide training on this topic. A member of the fire team had trouble getting the foam system actuated. He received training on the system when he was hired 5 years before, but had not received any refresher training since then."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 177,
    "text_chunk": "Was the training equipment adequate? Were simulators or demonstration/ example components used? Was the equipment used in training the same as that used on the job? Were the instructors and other personnel providing the training adequate? Do the instructor qualifications require the instructor to be able to perform the task? Was the instructor who performed the training qualified on this task?  Use simulators when possible to provide personnel with hands-on experience  If simulators are not a viable option, use models (perhaps computer models) instead. Ensure that the models are similar enough to the real equipment to avoid confusion (e.g., if a control button is actually red on the control panel, make sure it appears red on the cardboard model) When possible, use the same equipment in training that will be used on the job. PPE is a good example  Ensure that proper facilities and training equipment/supplies are avail- able for training and conducive to learning:  video equipment - overhead projectors  interactive workstations  distraction-free classrooms Provide guidance for determining instructor qualifications  Review current instructor qualifications for adequacy. Address any deficiencies that are found An operator made a mistake weighing material because of incorrect use of a scale. The scale he had used in training had key differences from the one used on the job. A mechanic had trouble repairing a transmitter. The repair required the operator to wear gloves and a respirator. When he had practiced in training, he did not wear any protective clothing because the training department did not have any of the required protective clothing."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 178,
    "text_chunk": "Was training provided on abnormal and emergency events? Did it include all the necessary elements? Was the frequency of the training adequate?  Include abnormal/nonroutine job tasks as part of the initial training as well as part of the continuing training. At a minimum, the lesson content Job/Task should include startup/shutdown procedures, emergency shutdown Analysis LTA procedures, and emergency evacuation and response  Provide refresher training for these events FREQUENTLY to give em- ployees confidence in dealing with these stressful activities Establish a frequency for providing training for the abnormal/emergency events and consult employees regarding the frequency  Ensure that the training mimics the anticipated events/emergencies as Lesson Content closely as practical (e.g., ensure that employees are wearing the PPE LTA prescribed for the event when walking through the tasks) Program Design/ Objectives LTA onthe job, Examples raining L  An operator opened the wrong valve during an emergency cooling water loss. He had been trained on the emergency response during his training, but did not have to perform the task while wearing the necessary protective clothing and while responding to many alarms. Qualification Testing LTA An operator opened the wrong valve during an emergency cooling water loss. Continuing He had received classroom training on the procedure, but had not performed Training LTA a walkthrough or performed the procedure in the plant. A member of the fire team had trouble getting the foam system actuated. He netaining | received training on the system when he was hired 5 years before, but had not received any refresher training since then. HOOCOOOOR During plant emergencies, management personnel were supposed to contact Abnormal Events/ sas + : : : Ry local authorities to coordinate evacuation of surrounding areas. During an Tal A ne actual event, the phone numbers that were to be called could not be found. No training had ever been provided on this task."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 179,
    "text_chunk": "Did immediate supervision fail to provide adequate preparation, job plans, or walkthroughs for a job? Were potential problems identified before the work began? Were appropriate personnel selected and scheduled for the task? Did immediate supervision fail to provide adequate support, coverage, or oversight during job performance? Did supervisors correct improper performance? Did personnel work together as a coordinated team? Adopt a standard job plan format Distribute duties equally among similarly skilled/trained per- sonnel  For nonroutine jobs or jobs that require specific safety precau- tions, encourage supervisors to oversee the job and provide job support as necessary Encourage supervisors to provide more supervision to less experienced workers Ensure that supervisors correct improper performance An operator failed to respond properly to an alarm because he was covering for two unit operators simultaneously. This was required because his immediate supervisor did not schedule enough control room operators to cover the shift operations. Operators were supposed to perform plant rounds at least once per shift and generate work requests for any equipment that was inoper- able or needed repairs. Often the operators skipped the rounds when it was cold or raining even though the rounds were still re- quired. Supervisors knew what was occurring and did nothing to correct the situation. IMMEDIATE SUPERVISION AppENDIX A  Root Cause Map Nope Descriptions Immediate Supervision DK Cee No Preparation Job Plan LTA Instructions to Supervision During Work Supervision LTA Improper Performance Not Corrected Workers LTA Walkthrough LTA."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 180,
    "text_chunk": "Did immediate supervision fail to provide adequate preparation, job plans, or walkthroughs for a job? Were potential interruptions or special circumstances identified before the work began? Were appropriate personnel selected and scheduled for the task? Ensure that supervisors understand their role in providing a job plan for subordinates  Adopt a standard job plan format Distribute duties equally among similarly skilled/trained personnel  Verify that the employee has the credentials to complete the task before assignment Late in the shift, a first-line supervisor instructed a mechanic to repair a valve in a confined space. However, his supervisor failed to schedule anyone else to assist with the entry. To get the job done before the end of the shift, the mechanic entered the confined space alone and died. A job required the coordinated effort of the operators, mechanics, and electricians. The electricians were the lead group on the project. The electrical supervisor failed to arrange for support from the other two groups. IMMEDIATE SUPERVISION Root Cause ANAtysis HANDBOOK Immediate Supervision Nea ete Job Plan LTA Instructions to Workers LTA Walkthrough LTA Scheduling LTA Worker Selection/ Assigment LTA Typical Issue Did immediate supervision fail to provide any preparation (e.g., instructions, job plan, walkthrough) for the task performed?  Ensure that supervisors understand that it is their responsibility to provide subordinates with instructions and/or a job plan, and to conduct walkthroughs when appropriate (to show workers the location of equip- ment or to discuss the proper sequence of steps, etc.)  Provide supervisors with written job descriptions so that the above responsibilities are clearly communicated and documented Provide coaching to supervisors whose job preparation skills are less than adequate An immediate supervisor sent his crew out to paint stripes in a parking lot. No instructions were given for the job. As a result, the crew used the wrong color paint to stripe the lot. In addition, the resulting parking places were not of adequate size to accommodate anything other than compact cars. A job required the coordinated effort of the operators, mechanics, and electri- cians. The electricians were the lead group on the project. The electrical supervisor failed to arrange for support from the other two groups. IMMEDIATE SUPERVISION Immediate Supervision Workers LTA Assigment LTA AppENDIX A  Root Cause Map Nope Descriptions Typical Issue Did immediate supervision provide an incorrect, incomplete, or otherwise inadequate job plan for performance of the work?  Establish an administrative procedure that requires all supervisors (including contract supervisors) to provide their subordinates with a job plan that includes instructions necessary for completing nonroutine job tasks  Establish a facilitywide job plan format to ensure that all necessary information is included in the job plan Example A new unit was undergoing its first turnaround. During the turnaround, maintenance personnel contaminated the replacement catalyst because of handling/loading errors. The new catalyst required special handling precau- tions that the crew was not aware of. The turnaround plans were the same as for the old unit that was replaced and did not provide for special handling of the new catalyst. IMMEDIATE SUPERVISION GE: Root Cause ANatysis HANDBOOK Immediate Supervision Preparation No Preparation = Cate) Job Plan LTA Lite oy Workers LTA Walkthrough LTA Scheduling LTA Worker Selection/ Assigment LTA Typical Issue Did immediate supervision provide incorrect, incomplete, or otherwise inad- equate job instructions before the beginning of work? Encourage a culture that is feedback oriented (i.e., repeating instructions back to the instructor to ensure understanding)  Train supervisors on how to give instructions and how to verify that instructions are understood An electrician was instructed to check the potential transformer on the main generator. His supervisor meant to tell him to check the potential transformer on an emergency generator. When the electrician opened the access panel on the main generator, the plant shut down. A captain of a commercial cargo plane ordered his copilot to set the throttles to the full position. The copilot thought a plane was still taxiing on their runway and that they should not take off. But, the captain was the captain, and the copilot felt he should follow his orders without question. As a result, their plane hit another plane and more than 500 people died. IMMEDIATE SUPERVISION AppENDIX A  Root Cause Map Nope Descriptions Immediate Supervision Workers LTA Mee LE LL Assigment LTA Typical Issue Did immediate supervision fail to perform an adequate walkthrough (show workers the location of equipment, discuss operation of the equipment and the proper sequence of steps, etc.) with the workers before they started their job? Encourage supervisors to show workers the location of equipment involved in the job task  Encourage supervisors to discuss operation of the equipment and the sequence of steps involved in nonroutine job tasks Example A team of expert mechanics was assembled to install a special piece of equipment in a new facility. Although these were experienced mechanics, they were unfamiliar with both the facility and the specific piece of equip- ment. The immediate supervisor assumed that, because these mechanics were experts in their field, they did not need to be stepped through the job. However, the job required some special precautions, and the mechanics damaged the equipment because they were not shown the specific problem areas before starting the job."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 185,
    "text_chunk": "Was scheduling of workers inadequate? Did immediate supervision arrange to have enough personnel available to effectively carry out the task? Were too many concurrent tasks assigned to workers? Were duties not well distributed among personnel? Immediate Supervision Preparation Note: This node addresses the scheduling of personnel only, not the schedul- ing of work activities. Problems with scheduling of work activities are ad- dressed under node 64, Planning, Scheduling, or Tracking of Work Activities No Preparation LTA (Administrative/Management Systems, SPACs LTA). Provide supervisors with an adequate number of employees to effec- tively and safely complete the tasks assigned for the shift Instructions to Distribute duties equally among similarly skilled/trained personnel Workers LTA * Consider the amount of time and concentration to perform each task. Assign individuals fewer responsibilities for tasks that require more time and concentration Job Plan LTA Walkthrough LTA Examples As a result of inadequate planning by a first-line supervisor, a control room Perey was staffed by one trained operator and five trainees. Because the trained operator was continuously stopped by the trainees to answer questions, he missed an important step in his own procedure. This caused a significant Worker Selection/ period of downtime in the facility. Assigment LTA HOHE Four mechanics and three electricians were assigned to install a new compres- sor. There was only enough work to keep two of the mechanics and one electrician busy. The remaining four workers just sat around and watched the others work."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 186,
    "text_chunk": "Did immediate supervision fail to select capable workers to perform the job? Did workers assigned to the task have inadequate credentials? Were sufficient numbers of trained or experienced workers assigned to the task? Note: This node addresses the assignment of existing or qualified workers to job tasks. For example, the selection of a laborer from a preapproved pool of individuals would be covered by this node. It does NOT address the hiring or preselection processes. Employee hiring is addressed by Employee Screening/ Hiring LTA (Administrative/Management Systems, SPACs LTA). Before assigning any emplovee to a task, verify that the employee has the credentials to successfully complete the task  Ensure that the individual assigned to a task matches the experience level required to effectively and safely perform the task Provide supervisors with the means to quickly determine if workers are qualified for a task Example Three technicians were assigned to a shift. Normally, at least one senior technician was assigned as the lead technician on each shift to plan and help coordinate the work. On the back shift, an older but inexperienced technician was assigned as lead technician even though he was not qualified. IMMEDIATE SUPERVISION Root Cause ANAtysis HANDBOOK Immediate Supervision Brcaeca) Preparation PR Cond No Preparation Supervision LTA Improper Job Plan LTA Performance Not Corrected Instructions to Workers LTA Teamwork LTA v Walkthrough LTA. Scheduling LTA Worker Selection/ Assigment LTA DOOOOOO Typical Issue Did immediate supervision fail to provide adequate support, cover- age, oversight, or supervision during job performance? Note: The investigator must judge what level of supervision was necessary based on the importance of the job in relation to safety and production. It is not possible or practical to provide supervision on every job.  For nonroutine jobs or jobs that require specific safety precau- tions, encourage supervisors to oversee the job and provide job support as necessary  Encourage supervisors to provide more supervision to less experienced workers Example A first-line supervisor was in his office performing audits of com- pleted procedures. He told the operator in the control room to contact him if problems arose. The operator, a newly qualified person on the job, did not want the supervisor to think that he did not know what he was doing, so he took his best guess when he had questions. By the time the supervisor came to the control room to check on the operators progress, a significant amount of product had already been lost to the waste stream."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 188,
    "text_chunk": "Did immediate supervision provide inadequate support, coverage, or over- sight during performance of the job? Was an inadequate level of supervision provided at the job site? Was contact with workers too infrequent? Did direct supervisions involvement in the task interfere with the supervisory overview role?  For nonroutine job tasks or for tasks that require specific safety precau- tions, encourage supervisors to remain at the job site to provide cover- age for the entire job, or at least frequently visit the job site to provide direction as necessary  Encourage supervisors to give their supervisory role priority over their job task support role  Ensure that supervisors understand their responsibilities to provide more supervision to less experienced workers Example A mechanic was told by his immediate supervisor to fix the leak in a tank containing a hazardous chemical. The supervisor gave him no instructions on how to perform the task and did not provide any oversight of the work activities. Because of the mechanics lack of understanding about the hazards associated with this job, he allowed the chemical to come into contact with his skin. This caused severe burns. During the installation of a new computer system, the immediate supervisor of the responsible crew became so interested in installing the central control unit that he picked up a screwdriver and became involved in the work. As a result, he ignored those members of the crew who were installing the auxiliary unit. Some important checks were missed on the auxiliary unit; therefore, it failed upon startup. IMMEDIATE SUPERVISION Gar Root Cause ANAtysis HANDBOOK Immediate Supervision Supervision During Work Supervision LTA Toray sd aurea log Perrott) Examples A supervisor noticed an operator in the process area who was not wearing a hard hat or safety goggles. The supervisor was just passing through the area and did not say anything to the operator."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 189,
    "text_chunk": "Do supervisors correct improper performance when they observe it or know about it? Do they let improper performance slip just this once? Correct the behavior when improper performance is observed or is known by supervision. If supervision knows a task is being performed incorrectly and does not correct it, workers will continue to perform the task incorrectly  Enforce existing rules and requirements. If the rule is important enough to exist, it should be enforced. If its not important enough to enforce, eliminate the requirement Operators were supposed to perform plant rounds at least once per shift and generate work requests for any equipment that was inoperable or needed repairs. Often the operators skipped the rounds when it was cold or raining even though the rounds were still required. Supervisors knew what was occurring and did nothing to correct the situation."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 190,
    "text_chunk": "Was there a lack of coordination between workers? Was a plan developed to assign responsibilities to different team members? Were there overlaps or gaps in the work that was assigned to different groups or team members? Was there a lack of communication between work groups? Immediate Supervision Supervision During Work Supervision LTA. Improper Performance Not Corrected On tasks that require coordination of work, ensure that tasks are as- signed to team members and that an adequate means of communica- tion is provided between workers  For work that requires coordination of multiple work groups (i.e., operations, maintenance, and chemists), ensure that there are clear methods and means for exchanging information between work groups Coordinate tasks between different work groups. Develop a work plan prior to beginning the work Example Work was being performed on two different portions of a pipeline. The work performed at one booster station affected the work being performed at the receiving station. Because the work of the two groups was not coordinated, a small release of material occurred from the pipeline. Ce eee IMMEDIATE SUPERVISION Gar Root Cause ANAtysis HANDBOOK Misunderstood Communication No Communication or Not Timely Job Turnover LTA Wrong Instructions Standard Terminology Not Used Method Unavailable or LTA Communication Within Shifts LTA Communication Between Shifts LTA Verification Repeat-back Not Used Communication Between Work Groups LTA Communication Between Shifts and Management LTA Long Message Communication with Contractors LTA Communication with Customers LTA Note: Communications is defined as the act of exchanging information. This node addresses many modes of communication (e.g., face-to-face, telephone, radio, short written messages, log entries). It does not address the more formal methods of communication involving written procedures, specifications, etc."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 191,
    "text_chunk": "Was the problem caused by a failure to communicate? Did a method or system exist for communicating between the groups or individuals? Was an error caused by misunderstood communication between person- nel? Was there incorrect, incomplete, or otherwise inadequate communication between workers during a shift or between workers during a shift change? Was there a problem communicating with contractors or customers? Typical Recommendations * Provide a backup means of communication when the primary system is inoperable  Establish standard terminology for equipment and operations * Use the repeat-back method of communication * Conduct shift change meetings to alert oncoming shifts of special job tasks, safety issues, or problems that occurred during the previous shift ener e ener eee eee COMMUNICATIONS AppENDIX A  Root Cause Map Nope Descriptions Cer Examples An operator opened the wrong valve, resulting in a process upset. He misunderstood the verbal instructions from a coworker. No repeat-back or other verification method was used. A tank transfer was in progress during shift change. During shift change, the shift going off duty did not tell the one coming on duty that the transfer was in progress. The tank overflowed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 193,
    "text_chunk": "Was the problem caused by a failure to communicate? Did a method or system exist for communicating between the groups or individuals? Did the communication take place too late? Did obstacles hinder or delay communication? Note: Each individual involved in the occurrence should be questioned regarding messages he or she feels should have been received or transmitted. Determine what means of communication were used (i.e., the techniques). Persons on all sides of a communication link should be questioned regarding known or sus- pected problems. Typical Recommendations * Provide a backup means of communication when the primary system is inoperable  Establish formal means of communication when required * Conduct meetings between shift workers and management Example An operator failed to close a valve when needed, resulting in a process upset. He should have received an instruction from control room personnel to close the valve. The instruction was not given to the operator in time because the two-way radios did not work in the area in which the operator was located."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 194,
    "text_chunk": "cations Did a method or system exist for communicating the necessary message or information? Was the communication system out of service or otherwise unavailable at the time of the incident? ne ertimey Typical Recommendations  Ensure that some method of communication is in working order at all times Urey} TENCE La ttle  When the primary method of communication is unavailable, provide ary some temporary means of communication (e.g., two-way radios) Communication Between Work Groups LTA Example An automatic valve was stuck open. The control room operator attempted to contact the building operator using the public address system to instruct him to manually close the valve. The public address system was not functioning properly, and the building operator could not be contacted, resulting in overflow of a vessel."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 195,
    "text_chunk": "Did lack of communication between work groups (production, technical, maintenance, warehouse, etc.) contribute to the incident? Did methods exist for communicating between work groups? Typical Recommendation  Establish an administrative procedure that requires a work permit (or sign-in/sign-out) to be issued and authorized by the controlling work group before another work group may perform job tasks in the control- ling work groups area Example A tank overflowed because maintenance had taken the liquid level instru- mentation out of service for calibration. A misunderstanding with production occurred over which equipment was out of service. Believing that it was another instrument that was being calibrated, production started a transfer into the tank, resulting in an overflow."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 196,
    "text_chunk": "Did lack of communication between management and the shifts contribute to the incident? Had management effectively communicated policies to the employees? Were employees concerns communicated to management? Conduct shift meetings that involve members of management during various shifts Provide a management/shift logbook for each production unit so that various issues concerning production, safety, maintenance, etc., can be communicated as needed between management and all shifts (and between shifts)  Provide a suggestion box in the facility  Encourage all employees to submit work requests/suggestions regarding maintenance, safety issues, etc., to management. Post the work requests weekly to acknowledge that the request was received, and include the status of the request A valve failed, resulting in a process upset. Shift employees had noticed problems with the valve and had expressed concern to the first-line supervi- sors, but the problem had not been recognized by management and cor- rected. A policy was recently changed that required personnel to enter their work hours into a new computer system. However, the details of the policy were not communicated to personnel on the weekend shift."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 197,
    "text_chunk": "evens Were there problems communicating with contractors? Were they made aware of changes in policies and procedures? Typical Recommendations No Communication or Not Timely * Provide methods for communication between your company and contractors Ensure that contractors have a designated contact in your organization * Provide policy and procedure updates to contractors Method Unavailable or LTA Example Communication Between Work A A contractor was assigned the task of digging a ditch to install an under- roups LTA ground tank. An engineer used flags to mark areas that should be avoided so as not to disturb underground utilities. The contractor thought the flags marked the spot to dig. As a result, a natural gas line feeding the plant was struck and broken."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 198,
    "text_chunk": "Were there problems communicating with customers? Are customers able to communicate their needs to the company? Does the company respond to requests from customers? Are phone calls returned and letters acknowledged?  Track customer calls and letters to ensure timely processing * Provide convenient means for customers to contact the company A customer called with a question on installation of your product. The cus- tomer was told that an installation technician would return the call in an hour. The customer called again the next day after having not been called back. A customer called in to order a batch of stainless steel bolts. The order was not recorded correctly, and the customer received a batch of threaded rods instead."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 199,
    "text_chunk": "Was an error caused by misunderstood communications between personnel? Was there an error in verbal communication? Did someone misunderstand a hand signal? Was a sign misunderstood? Were oral instruc- tions given when written instructions should have been provided? Establish standard terminology for equipment and operations * Use the repeat-back method of communication  Provide written instructions when necessary Minimize interference from noise Example An operator located in a noisy part of the plant was given an instruction by walkie-talkie to open Valve B-2. He thought the verbal instruction was to open Valve D-2. No repeat-back or other type of verification was used. He opened D-2, resulting in a process upset."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 200,
    "text_chunk": "Was standard or accepted terminology used? Could the communication be interpreted more than one way? Did one piece of equipment have two or more commonly used names? Could the terminology have applied to more than one item?  Establish standard terminology for equipment, process operations, and maintenance operations. Encourage all employees to stop using non- standard terminology  Avoid ambiguous terms and phrases in procedures, work instructions, logbooks, etc. Example An operator was told to verify that a solution was clear before adding it toa process. The operator thought that clear meant not cloudy. What was actually meant was no color since color was an indication of contaminants in the solution. The solution was clear (translucent), but had a slightly pink tint. As a result, an out-of-specification solution was used. COMMUNICATIONS Be Root Cause ANAtysis HANDBOOK Communi Typical Issue arene Was a communication error caused by failure to repeat a message back to the sender for the purpose of verifying that the message was heard and under- stood correctly? Misunderstood Communication Standard Terminology Not Used MOTTE Encourage employees and personnel at all levels to use the repeat-back communication method to ensure thorough understanding of related job tasks  If employees/workers forget to use the repeat-back method, instruct supervisors and work team leaders to request that the employee repeat ees ea back Used Example An operator was given an instruction by walkie-talkie to open a valve. The instruction was to open Valve B-2. The operator understood D-2. No repeat- back or other type of verification was used."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 202,
    "text_chunk": "Was a message or instruction misunderstood because it was too long? Should the message have been written instead of spoken? Could the message have been shortened or broken up? Typical Recommendations  Keep oral instructions short and rehearsed (especially if communicating in noisy areas)  If several lengthy details must be conveyed, consider providing them as written instructions rather than oral (i.e., generate a written procedure) Example An operator was verbally instructed to open Valves A-7, B-4, B-5, C-6, D-6, D-7, D-8, and F-1. He failed to open D-6, resulting in a process upset. No written instructions were given. COMMUNICATIONS Cer Root Cause ANAtysis HANDBOOK Communi- cations Misunderstood Communication No Communication or Not Timely Job Turnover LTA Wrong Instructions Standard Terminology Not Used Method Unavailable or LTA Communication Within Shifts LTA Communication Between Shifts LTA Verification/ Repeat-back Not Used Communication Between Work Groups LTA Communication Between Shifts and Management LTA Long Message Communication with Contractors LTA Communication with Customers LTA Typical Issue Was the communication errant or inaccurate? ypical Recommendation  Consult the procedure, training, supervision, human factors engineering, and/or personal performance branches of the map Example A supervisor told an operator to open Valve 101 instead of Valve 201. ener e ener eee eee COMMUNICATIONS AppENDIX A  Root Cause Map Nope Descriptions Ee Typical Issue Communi- cations No Communication or Not Timely Method Unavailable or LTA Communication Between Work Groups LTA Communication Between Shifts and Management LTA Communication with Contractors LTA Communication with Customers LTA Misunderstood Communication Standard Terminology Not Used Verification! Repeat-back Not Used Long Message Wrong Instructions Aaa Communication Within Shifts LTA Communication Between Shifts LTA Was there incorrect, incomplete, or otherwise inadequate communication between workers during a shift or between shifts during a shift change? Typical Recommendations Provide a means of communication for employees working on the same shift (e.g., two-way radios) Conduct shift change meetings to alert oncoming shifts of special job tasks, safety issues, or problems that occurred during the previous shift Provide guidance on the content of shift turnovers Example A tank transfer was in progress during shift change. During shift change, the shift going off duty did not tell the one coming on that the transfer was in progress. The tank overflowed."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 203,
    "text_chunk": "cations Was there incorrect, incomplete, or otherwise inadequate communication between workers during a shift? Could a more effective method of communi- cation have been used? Note: Planning and coordination of jobs between individuals and work groups should be coded under Teamwork LTA (Immediate Supervision, Supervision During Work). MMT EN CE Typical Recommendations  Encourage employees to alert others on their shift of changes in job Communication tasks that may affect others (tell others when you plan to take a break, LTA tell others when you move from one job location to another, etc.) Job Turnover LTA Encourage employees to keep each other informed about changes in equipment status that may affect other areas of the plant Example A tank transfer was in progress when Operator A went on break. He men- tioned to Operator B that the transfer was going on, but Operator B did not realize that he needed to stop the transfer. As a result, the tank overflowed. ener e ener eee eee COMMUNICATIONS AppENDIX A  Root Cause Map Nope Descriptions Communi- cations Job Turnover LTA Communication Within Shifts LTA PT Cal er Tic) LTA Typical Issue Was there incorrect, incomplete, or otherwise inadequate communication between workers during a shift change? Conduct shift change meetings to alert the oncoming shifts of special job tasks, safety issues, or problems that occurred during the previous shift Use logbooks to communicate between shifts  Provide guidance on the content of shift turnovers Example A tank transfer was in progress during shift change. During the turnover, the shift going off duty did not tell the one coming on that the transfer was in progress. The tank overflowed. COMMUNICATIONS Root Cause ANAtysis HANDBOOK eur Uy Problem Sensory/Perceptual Reasoning Capabilities Motor/Physical Attitude/Attention Rest/Sleep LTA Personal/Medication LTat LTa* (Fatigue)* Problems* Detection LTA Capabilities LTA\" Capabilities LTA* Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 207,
    "text_chunk": "Note: The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Did the workers physical or mental well-being, attitude, mental capacity, attention span, rest, substance abuse, etc., adversely affect the performance of the task? Was the problem the result of the individual not being capable of performing the task or not wanting to do his or her job? Was a personal performance problem promptly detected? Was corrective action promptly taken?  Ensure that there is a process in place to detect personal performance problems * Provide a means for personnel to self-report problems An operator failed to close a valve after completion of a transfer. The operator was not paying attention to the level of the tank into which the material was being transferred. The operator had a history of not paying attention to his work. He had been involved in several other incidents during which he had left his job site or was not performing his job requirements. Other operators performed these same job requirements with no problems. An individual came to work drunk. The operator was stumbling while walking to his workstation. However, no one did anything to stop him from going to work. PERSONAL PERFORMANCE AppENDIX A  Root Cause Map Nope Descriptions } A-209| Personal Performance ero Sensory/Perceptual Reasoning Capabilities Motor/Physical Attitude/Attention Rest/Sleep LTA Personal/Medication LTa*  Drea Capabilities LTA* Capabilities LTA* LTA (Fatigue)* Problems* Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 208,
    "text_chunk": "Did personal performance issues contribute to the event? Should the personal performance issues have been detected prior to the event? Note: Consider dual coding under Supervision LTA (Immediate Supervision, Supervision During Work).  Provide supervisors with training on the detection of personal problems Give supervisors the authority to remove workers from hazardous assignments when personal prob- lems are detected Encourage coworkers to help identify personal performance problems A worker came to work drunk. He was having trouble walking and talking. While going to get a part from the warehouse, he fell down some steps and injured himself and another worker. Six months ago, a maintenance technician was hired who could not read. His supervisor had not detected the problem, even though this technician had trouble with all of his nonroutine tasks (those that required him to use a procedure). PERSONAL PERFORMANCE Be Root Cause ANAtysis HANDBOOK Personal Performance Problem TSM (Reasoning Capabilities Motor/Physical Attitude/Attention Rest/Sleep LTA Personal/Medication Uta LTA* . Detection LTA eT Capabilities LTA* (Fatigue)* Problems Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 209,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Was the problem a result of less than adequate vision (e.g., poor visual acuity, color blindness, tunnel vi- sion)? Was the problem a result of some defect in hearing (e.g., hearing loss, tone deafness)? Was the prob- lem a result of some sensory defect (e.g., poor sense of touch or smell)?  Ensure that job requirements are complete, including required physical/perceptual capabilities  Provide reasonable accomodations for coworkers with sensory/perceptual limits Note: A review of the human factors engineering for the process is also appropriate to accommodate a wider spectrum of sensory capabilities. For example: Can the displays be redesigned so that lights that indicate closed conditions of valves are always in the same relative location on the panel? Can more chart record- ers be installed with fewer points per chart? Example An operator read the wrong temperature on a chart that recorded temperatures for several tanks. The chart was color coded. The operator was partially color blind and confused the readings. He recorded a tempera- ture that was in range when the actual temperature was out of range. Note: Consider coding under Employee Screening/Hiring LTA (Administrative/Management Systems, SPACs LTA) because there should be management controls to ensure employees possess the required job capabilities. ener e ener eee eee PERSONAL PERFORMANCE AppENDIX A  Root Cause Map Nope Descriptions Ce Personal Performance Problem Sensory/Perceptual Detection LTA Capabilities LTA* Reasoning Capabilities nN Motor/Physical Attitude/Attention Rest/Sleep LTA Personal/Medication LTA* * Capabilities LTA* (Fatigue* Problems Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 210,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Was the problem caused by inadequate intellectual capacity? Does the person frequently make wrong decisions? In general, does the person have difficulty processing information? Do other workers have diffi- culty performing these tasks or is it isolated to this one worker? Typical Recommendation Review employee screening and hiring processes to ensure that the individuals who are hired have the required reasoning capabilities An operator made a mistake in a calculation and added too much material to the mixer. The operator had frequently made errors with calculations and appeared to have problems with numbers. Other operators did not have difficulty performing these tasks. An operator missed several steps in a procedure. The operator was unable to clearly understand the proce- dures because they were written at a sixth-grade level and he could only read at a second-grade level. Note: Consider coding under Employee Screening/Hiring LTA (Administrative/Management Systems, SPACs LTA) as well, since there should be management controls to ensure that employees possess the appropriate reading and mathematical skills."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 211,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Can the causal factor be attributed to trouble with inadequate coordination or inadequate strength? Was the problem a result of inadequate size or stature of the individual involved? Did other physical limitations (e.g., shaking, poor reaction time) contribute to the problem? Ensure that job requirements are complete, including required physical/perceptual capabilities  Provide reasonable accomodations for workers with physical limitations Note: A review of the human factors engineering for the process is also appropriate. Is it reasonable for an average individual to perform this task? Can the individual be provided with a tool to assist in the task? Can the task be redesigned to reduce the physical requirements? Example A tank overflowed because the operator could not close the valve. The valve was large and difficult to close. The operator did not have the strength to close the valve. By the time he obtained help in closing it, the tank had overflowed. Note: Consider coding under Employee Screening/Hiring LTA (Administrative/Management Systems, SPACs LTA) because there should be management controls to ensure employees possess the required job capabilities. ener e ener eee eee PERSONAL PERFORMANCE AppENDIX A  Root Cause Map Nope Descriptions Lex Personal Performance Problem Sensory/Perceptual ) (Reasoning Capabilities Motor/Physical Attitude/Attention Rest/Sleep LTA Personal/Medication LTA* LTA* * Detection LTA Capabilities LTA* Capabilities LTA* (Fatigue) Problems Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 212,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Was the problem a result of a poor attitude on the part of an individual? Did the individual involved show signs of emotional illness? Was the problem caused by lack of attention? Does the individual involved in this occurrence frequently daydream? Is the person distracted easily? Is the persons ability to maintain vigi- lance frequently below minimum acceptable standards? Do other workers have difficulty performing these tasks or is it isolated to this one worker? Typical characteristics include:  engages in horseplay  is not at work location  does not perform expected work  exhibits maliciousness  exhibits inability to operate under stress  exhibits insubordination  exhibits inability to work well or communicate with other people  ignores safety rules An operator failed to close a valve while filling a tank, resulting in an overflow from the tank and a process upset. The operator often was away from his assigned work location for personal reasons, such as making personal phone calls. An operator failed to stop a transfer, resulting in a tank overflow. The operator had a history of being dis- tracted easily and losing track of the next step in the process. Note: Consider coding under Employee Screening/Hiring LTA (Administrative/Management Systems, SPACs LTA) because there should be management controls to ensure employees possess the required job capabilities. Also consider coding under Supervision LTA (Immediate Supervision, Supervision During Work) because supervision should detect this problem. ener e ener eee eee PERSONAL PERFORMANCE Cex Root Cause ANAtysis HANDBOOK Personal Performance Problem Sensory/Perceptual Reasoning Capabilities Motor/Physical Attitude/Attention ROC aa Personal/Medication LTA* LTA* Detection LTA Capabilities LTA* Capabilities LTA* Greg Problems* Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 213,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Note: This node addresses problems associated with an individuals rest and sleep practices outside of the workplace. Problems with workers who are forced to work unreasonable amounts of overtime should be coded using the Immediate Supervision or Administrative/Management Systems segments of the map. Was the worker involved in the incident asleep while on duty? Was the person too tired to perform the job? Example A mechanic was found asleep while he was supposed to be calibrating equipment. The mechanic had another job away from the site and routinely appeared to be extremely tired. ener e ener eee eee PERSONAL PERFORMANCE AppENDIX A  Root Cause Map Nope Descriptions exo Personal Performance Problem Sensory/Perceptual Reasoning Capabilities Motor/Physical Attitude/Attention Rest/Sleep LTA Pe eit LTA* LTA* a Detection LTA Capabilities LTA\" Capabilities LTA* (Fatiguey* Problems Do not include these nodes in the investigation report."
  },
  {
    "source_document": "RCA_ABSgroup.pdf",
    "start_page": 214,
    "text_chunk": "Note: Code as Personal Performance only. The six asterisked Level D nodes (ovals, near root causes) are included to provide the investigator with an understanding of the types of problems that might be categorized as Personal Performance issues. However, the investigator should not include these Level D nodes in the investigation report. Also, there should be management systems in place to detect and correct most (if not all) personal performance issues before a loss event occurs. Therefore, the failure or absence of the management systems should be coded as well. Is the individual experiencing personal problems that are affecting his or her job performance? Is the indi- vidual taking medications that affect his or her job performance? Typical symptoms include: chronic inattention  acute inattention  frequent daydreaming  easily distracted  poor vigilance  illness  impairment due to prescription drugs  poor psychological health  abuse of drugs/alcohol  Establish an employee assistance program  Inform and encourage workers to take advantage of employee assistance programs Example An operator was prescribed a medication that caused drowsiness. During a tank transfer, he lost track of time and the tank overflowed."
  }
]